hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
/*
; stm32N657_dcmipp.
; =================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_dcmipp equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// DCMIPP address definitions
// --------------------------

typedef struct {
	volatile	uint32_t	IPGR1;
	volatile	uint32_t	IPGR2;
	volatile	uint32_t	IPGR3;
	volatile	uint32_t	RESERVED0[4];
	volatile	uint32_t	IPGR8;
	volatile	uint32_t	IPC1R1;
	volatile	uint32_t	IPC1R2;
	volatile	uint32_t	IPC1R3;
	volatile	uint32_t	RESERVED1;
	volatile	uint32_t	IPC2R1;
	volatile	uint32_t	IPC2R2;
	volatile	uint32_t	IPC2R3;
	volatile	uint32_t	RESERVED2;
	volatile	uint32_t	IPC3R1;
	volatile	uint32_t	IPC3R2;
	volatile	uint32_t	IPC3R3;
	volatile	uint32_t	RESERVED3;
	volatile	uint32_t	IPC4R1;
	volatile	uint32_t	IPC4R2;
	volatile	uint32_t	IPC4R3;
	volatile	uint32_t	RESERVED4;
	volatile	uint32_t	IPC5R1;
	volatile	uint32_t	IPC5R2;
	volatile	uint32_t	IPC5R3;
	volatile	uint32_t	RESERVED5[38];
	volatile	uint32_t	PRCR;
	volatile	uint32_t	PRESCR;
	volatile	uint32_t	PRESUR;
	volatile	uint32_t	RESERVED6[57];
	volatile	uint32_t	PRIER;
	volatile	uint32_t	PRSR;
	volatile	uint32_t	PRFCR;
	volatile	uint32_t	RESERVED7;
	volatile	uint32_t	CMCR;
	volatile	uint32_t	CMFRCR;
	volatile	uint32_t	RESERVED8[121];
	volatile	uint32_t	CMIER;
	volatile	uint32_t	CMSR1;
	volatile	uint32_t	CMSR2;
	volatile	uint32_t	CMFCR;
	volatile	uint32_t	RESERVED9;
	volatile	uint32_t	P0FSCR;
	volatile	uint32_t	RESERVED10[62];
	volatile	uint32_t	P0FCTCR;
	volatile	uint32_t	P0SCSTR;
	volatile	uint32_t	P0SCSZR;
	volatile	uint32_t	RESERVED11[41];
	volatile	uint32_t	P0DCCNTR;
	volatile	uint32_t	P0DCLMTR;
	volatile	uint32_t	RESERVED12[2];
	volatile	uint32_t	P0PPCR;
	volatile	uint32_t	P0PPM0AR1;
	volatile	uint32_t	P0PPM0AR2;
	volatile	uint32_t	RESERVED13;
	volatile	uint32_t	P0STM0AR;
	volatile	uint32_t	RESERVED14[8];
	volatile	uint32_t	P0IER;
	volatile	uint32_t	P0SR;
	volatile	uint32_t	P0FCR;
	volatile	uint32_t	RESERVED15;
	volatile	uint32_t	P0CFSCR;
	volatile	uint32_t	RESERVED16[62];
	volatile	uint32_t	P0CFCTCR;
	volatile	uint32_t	P0CSCSTR;
	volatile	uint32_t	P0CSCSZR;
	volatile	uint32_t	RESERVED17[45];
	volatile	uint32_t	P0CPPCR;
	volatile	uint32_t	P0CPPM0AR1;
	volatile	uint32_t	P0CPPM0AR2;
	volatile	uint32_t	RESERVED18[14];
	volatile	uint32_t	P1FSCR;
	volatile	uint32_t	RESERVED19[6];
	volatile	uint32_t	P1SRCR;
	volatile	uint32_t	P1BPRCR;
	volatile	uint32_t	P1BPRSR;
	volatile	uint32_t	RESERVED20;
	volatile	uint32_t	P1DECR;
	volatile	uint32_t	RESERVED21[3];
	volatile	uint32_t	P1BLCCR;
	volatile	uint32_t	P1EXCR1;
	volatile	uint32_t	P1EXCR2;
	volatile	uint32_t	RESERVED22;
	volatile	uint32_t	P1ST1CR;
	volatile	uint32_t	P1ST2CR;
	volatile	uint32_t	P1ST3CR;
	volatile	uint32_t	P1STSTR;
	volatile	uint32_t	P1STSZR;
	volatile	uint32_t	P1ST1SR;
	volatile	uint32_t	P1ST2SR;
	volatile	uint32_t	P1ST3SR;
	volatile	uint32_t	P1DMCR;
	volatile	uint32_t	RESERVED23[3];
	volatile	uint32_t	P1CCCR;
	volatile	uint32_t	P1CCRR1;
	volatile	uint32_t	P1CCRR2;
	volatile	uint32_t	P1CCGR1;
	volatile	uint32_t	P1CCGR2;
	volatile	uint32_t	P1CCBR1;
	volatile	uint32_t	P1CCBR2;
	volatile	uint32_t	RESERVED24;
	volatile	uint32_t	P1CTCR1;
	volatile	uint32_t	P1CTCR2;
	volatile	uint32_t	P1CTCR3;
	volatile	uint32_t	RESERVED25[21];
	volatile	uint32_t	P1FCTCR;
	volatile	uint32_t	P1CRSTR;
	volatile	uint32_t	P1CRSZR;
	volatile	uint32_t	P1DCCR;
	volatile	uint32_t	P1DSCR;
	volatile	uint32_t	P1DSRTIOR;
	volatile	uint32_t	P1DSSZR;
	volatile	uint32_t	RESERVED26;
	volatile	uint32_t	P1CMRICR;
	volatile	uint32_t	P1RI1CR1;
	volatile	uint32_t	P1RI1CR2;
	volatile	uint32_t	P1RI2CR1;
	volatile	uint32_t	P1RI2CR2;
	volatile	uint32_t	P1RI3CR1;
	volatile	uint32_t	P1RI3CR2;
	volatile	uint32_t	P1RI4CR1;
	volatile	uint32_t	P1RI4CR2;
	volatile	uint32_t	P1RI5CR1;
	volatile	uint32_t	P1RI5CR2;
	volatile	uint32_t	P1RI6CR1;
	volatile	uint32_t	P1RI6CR2;
	volatile	uint32_t	P1RI7CR1;
	volatile	uint32_t	P1RI7CR2;
	volatile	uint32_t	P1RI8CR1;
	volatile	uint32_t	P1RI8CR2;
	volatile	uint32_t	RESERVED27[3];
	volatile	uint32_t	P1GMCR;
	volatile	uint32_t	RESERVED28[3];
	volatile	uint32_t	P1YUVCR;
	volatile	uint32_t	P1YUVRR1;
	volatile	uint32_t	P1YUVRR2;
	volatile	uint32_t	P1YUVGR1;
	volatile	uint32_t	P1YUVGR2;
	volatile	uint32_t	P1YUVBR1;
	volatile	uint32_t	P1YUVBR2;
	volatile	uint32_t	RESERVED29[9];
	volatile	uint32_t	P1PPCR;
	volatile	uint32_t	P1PPM0AR1;
	volatile	uint32_t	P1PPM0AR2;
	volatile	uint32_t	P1PPM0PR;
	volatile	uint32_t	P1STM0AR;
	volatile	uint32_t	P1PPM1AR1;
	volatile	uint32_t	P1PPM1AR2;
	volatile	uint32_t	P1PPM1PR;
	volatile	uint32_t	P1STM1AR;
	volatile	uint32_t	P1PPM2AR1;
	volatile	uint32_t	P1PPM2AR2;
	volatile	uint32_t	RESERVED30;
	volatile	uint32_t	P1STM2AR;
	volatile	uint32_t	P1IER;
	volatile	uint32_t	P1SR;
	volatile	uint32_t	P1FCR;
	volatile	uint32_t	RESERVED31;
	volatile	uint32_t	P1CFSCR;
	volatile	uint32_t	RESERVED32[7];
	volatile	uint32_t	P1CBPRCR;
	volatile	uint32_t	RESERVED33[6];
	volatile	uint32_t	P1CBLCCR;
	volatile	uint32_t	P1CEXCR1;
	volatile	uint32_t	P1CEXCR2;
	volatile	uint32_t	RESERVED34;
	volatile	uint32_t	P1CST1CR;
	volatile	uint32_t	P1CST2CR;
	volatile	uint32_t	P1CST3CR;
	volatile	uint32_t	P1CSTSTR;
	volatile	uint32_t	P1CSTSZR;
	volatile	uint32_t	RESERVED35[7];
	volatile	uint32_t	P1CCCCR;
	volatile	uint32_t	P1CCCRR1;
	volatile	uint32_t	P1CCCRR2;
	volatile	uint32_t	P1CCCGR1;
	volatile	uint32_t	P1CCCGR2;
	volatile	uint32_t	P1CCCBR1;
	volatile	uint32_t	P1CCCBR2;
	volatile	uint32_t	RESERVED36;
	volatile	uint32_t	P1CCTCR1;
	volatile	uint32_t	P1CCTCR2;
	volatile	uint32_t	P1CCTCR3;
	volatile	uint32_t	RESERVED37[21];
	volatile	uint32_t	P1CFCTCR;
	volatile	uint32_t	P1CCRSTR;
	volatile	uint32_t	P1CCRSZR;
	volatile	uint32_t	P1CDCCR;
	volatile	uint32_t	P1CDSCR;
	volatile	uint32_t	P1CDSRTIOR;
	volatile	uint32_t	P1CDSSZR;
	volatile	uint32_t	RESERVED38;
	volatile	uint32_t	P1CCMRICR;
	volatile	uint32_t	P1CRI1CR1;
	volatile	uint32_t	P1CRI1CR2;
	volatile	uint32_t	P1CRI2CR1;
	volatile	uint32_t	P1CRI2CR2;
	volatile	uint32_t	P1CRI3CR1;
	volatile	uint32_t	P1CRI3CR2;
	volatile	uint32_t	P1CRI4CR1;
	volatile	uint32_t	P1CRI4CR2;
	volatile	uint32_t	P1CRI5CR1;
	volatile	uint32_t	P1CRI5CR2;
	volatile	uint32_t	P1CRI6CR1;
	volatile	uint32_t	P1CRI6CR2;
	volatile	uint32_t	P1CRI7CR1;
	volatile	uint32_t	P1CRI7CR2;
	volatile	uint32_t	P1CRI8CR1;
	volatile	uint32_t	P1CRI8CR2;
	volatile	uint32_t	RESERVED39[23];
	volatile	uint32_t	P1CPPCR;
	volatile	uint32_t	P1CPPM0AR1;
	volatile	uint32_t	P1CPPM0AR2;
	volatile	uint32_t	P1CPPM0PR;
	volatile	uint32_t	RESERVED40;
	volatile	uint32_t	P1CPPM1AR1;
	volatile	uint32_t	P1CPPM1AR2;
	volatile	uint32_t	P1CPPM1PR;
	volatile	uint32_t	RESERVED41;
	volatile	uint32_t	P1CPPM2AR1;
	volatile	uint32_t	P1CPPM2AR2;
	volatile	uint32_t	RESERVED42[6];
	volatile	uint32_t	P2FSCR;
	volatile	uint32_t	RESERVED43[62];
	volatile	uint32_t	P2FCTCR;
	volatile	uint32_t	P2CRSTR;
	volatile	uint32_t	P2CRSZR;
	volatile	uint32_t	P2DCCR;
	volatile	uint32_t	P2DSCR;
	volatile	uint32_t	P2DSRTIOR;
	volatile	uint32_t	P2DSSZR;
	volatile	uint32_t	RESERVED44;
	volatile	uint32_t	P2CMRICR;
	volatile	uint32_t	P2RI1CR1;
	volatile	uint32_t	P2RI1CR2;
	volatile	uint32_t	P2RI2CR1;
	volatile	uint32_t	P2RI2CR2;
	volatile	uint32_t	P2RI3CR1;
	volatile	uint32_t	P2RI3CR2;
	volatile	uint32_t	P2RI4CR1;
	volatile	uint32_t	P2RI4CR2;
	volatile	uint32_t	P2RI5CR1;
	volatile	uint32_t	P2RI5CR2;
	volatile	uint32_t	P2RI6CR1;
	volatile	uint32_t	P2RI6CR2;
	volatile	uint32_t	P2RI7CR1;
	volatile	uint32_t	P2RI7CR2;
	volatile	uint32_t	P2RI8CR1;
	volatile	uint32_t	P2RI8CR2;
	volatile	uint32_t	RESERVED45[3];
	volatile	uint32_t	P2GMCR;
	volatile	uint32_t	RESERVED46[19];
	volatile	uint32_t	P2PPCR;
	volatile	uint32_t	P2PPM0AR1;
	volatile	uint32_t	P2PPM0AR2;
	volatile	uint32_t	P2PPM0PR;
	volatile	uint32_t	P2STM0AR;
	volatile	uint32_t	RESERVED47[8];
	volatile	uint32_t	P2IER;
	volatile	uint32_t	P2SR;
	volatile	uint32_t	P2FCR;
	volatile	uint32_t	RESERVED48;
	volatile	uint32_t	P2CFSCR;
	volatile	uint32_t	RESERVED49[62];
	volatile	uint32_t	P2CFCTCR;
	volatile	uint32_t	P2CCRSTR;
	volatile	uint32_t	P2CCRSZR;
	volatile	uint32_t	P2CDCCR;
	volatile	uint32_t	P2CDSCR;
	volatile	uint32_t	P2CDSRTIOR;
	volatile	uint32_t	P2CDSSZR;
	volatile	uint32_t	RESERVED50;
	volatile	uint32_t	P2CCMRICR;
	volatile	uint32_t	P2CRI1CR1;
	volatile	uint32_t	P2CRI1CR2;
	volatile	uint32_t	P2CRI2CR1;
	volatile	uint32_t	P2CRI2CR2;
	volatile	uint32_t	P2CRI3CR1;
	volatile	uint32_t	P2CRI3CR2;
	volatile	uint32_t	P2CRI4CR1;
	volatile	uint32_t	P2CRI4CR2;
	volatile	uint32_t	P2CRI5CR1;
	volatile	uint32_t	P2CRI5CR2;
	volatile	uint32_t	P2CRI6CR1;
	volatile	uint32_t	P2CRI6CR2;
	volatile	uint32_t	P2CRI7CR1;
	volatile	uint32_t	P2CRI7CR2;
	volatile	uint32_t	P2CRI8CR1;
	volatile	uint32_t	P2CRI8CR2;
	volatile	uint32_t	RESERVED51[23];
	volatile	uint32_t	P2CPPCR;
	volatile	uint32_t	P2CPPM0AR1;
	volatile	uint32_t	P2CPPM0AR2;
} DCMIPP_TypeDef;

#if (defined(__cplusplus))
#define	DCMIPP_NS	reinterpret_cast<DCMIPP_TypeDef *>(0x48002000u)
#define	DCMIPP_S	reinterpret_cast<DCMIPP_TypeDef *>(0x58002000u)

#else
#define	DCMIPP_NS	((DCMIPP_TypeDef *)0x48002000u)
#define	DCMIPP_S	((DCMIPP_TypeDef *)0x58002000u)
#endif

// IPGR1 Configuration

#define	DCMIPP_IPGR1_QOS_MODE				(0x1u<<24)
#define	DCMIPP_IPGR1_MEMORYPAGE				(0x7u<<0)
#define	DCMIPP_IPGR1_MEMORYPAGE_0			(0x1u<<0)

#define	DCMIPP_IPGR1_MEMORYPAGE_B_0X0		(0x0u<<0)
#define	DCMIPP_IPGR1_MEMORYPAGE_B_0X1		(0x1u<<0)

// IPGR2 Configuration

