hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_IPGR2_PSTART					(0x1u<<0)

#define	DCMIPP_IPGR2_PSTART_B_0X0			(0x0u<<0)
#define	DCMIPP_IPGR2_PSTART_B_0X1			(0x1u<<0)

// IPGR3 Configuration

#define	DCMIPP_IPGR3_IDLE					(0x1u<<0)

#define	DCMIPP_IPGR3_IDLE_B_0X0				(0x0u<<0)
#define	DCMIPP_IPGR3_IDLE_B_0X1				(0x1u<<0)

// IPGR8 Configuration

#define	DCMIPP_IPGR8_IPPID					(0xFFu<<24)
#define	DCMIPP_IPGR8_IPPID_0				(0x1u<<24)
#define	DCMIPP_IPGR8_ARCHIID				(0x1Fu<<16)
#define	DCMIPP_IPGR8_ARCHIID_0				(0x1u<<16)
#define	DCMIPP_IPGR8_REVID					(0x1Fu<<8)
#define	DCMIPP_IPGR8_REVID_0				(0x1u<<8)
#define	DCMIPP_IPGR8_DID					(0x3Fu<<0)
#define	DCMIPP_IPGR8_DID_0					(0x1u<<0)

// IPC1R1 Configuration

#define	DCMIPP_IPC1R1_OTR					(0xFu<<8)
#define	DCMIPP_IPC1R1_OTR_0					(0x1u<<8)
#define	DCMIPP_IPC1R1_TRAFFIC				(0x7u<<0)
#define	DCMIPP_IPC1R1_TRAFFIC_0				(0x1u<<0)

#define	DCMIPP_IPC1R1_OTR_B_0X0				(0x0u<<8)
#define	DCMIPP_IPC1R1_OTR_B_0X1				(0x1u<<8)
#define	DCMIPP_IPC1R1_TRAFFIC_B_0X0			(0x0u<<0)
#define	DCMIPP_IPC1R1_TRAFFIC_B_0X1			(0x1u<<0)

// IPC1R2 Configuration

#define	DCMIPP_IPC1R2_WLRU					(0xFu<<16)
#define	DCMIPP_IPC1R2_WLRU_0				(0x1u<<16)
#define	DCMIPP_IPC1R2_SVCMAPPING			(0xFu<<8)
#define	DCMIPP_IPC1R2_SVCMAPPING_0			(0x1u<<8)

#define	DCMIPP_IPC1R2_WLRU_B_0X0			(0x0u<<16)
#define	DCMIPP_IPC1R2_WLRU_B_0X1			(0x1u<<16)

// IPC1R3 Configuration

#define	DCMIPP_IPC1R3_DPREGEND				(0x3FFu<<16)
#define	DCMIPP_IPC1R3_DPREGEND_0			(0x1u<<16)
#define	DCMIPP_IPC1R3_DPREGSTART			(0x3FFu<<0)
#define	DCMIPP_IPC1R3_DPREGSTART_0			(0x1u<<0)

// IPC2R1 Configuration

#define	DCMIPP_IPC2R1_OTR					(0xFu<<8)
#define	DCMIPP_IPC2R1_OTR_0					(0x1u<<8)
#define	DCMIPP_IPC2R1_TRAFFIC				(0x7u<<0)
#define	DCMIPP_IPC2R1_TRAFFIC_0				(0x1u<<0)

#define	DCMIPP_IPC2R1_OTR_B_0X0				(0x0u<<8)
#define	DCMIPP_IPC2R1_OTR_B_0X1				(0x1u<<8)
#define	DCMIPP_IPC2R1_TRAFFIC_B_0X0			(0x0u<<0)
#define	DCMIPP_IPC2R1_TRAFFIC_B_0X1			(0x1u<<0)

// IPC2R2 Configuration

#define	DCMIPP_IPC2R2_WLRU					(0xFu<<16)
#define	DCMIPP_IPC2R2_WLRU_0				(0x1u<<16)
#define	DCMIPP_IPC2R2_SVCMAPPING			(0xFu<<8)
#define	DCMIPP_IPC2R2_SVCMAPPING_0			(0x1u<<8)

#define	DCMIPP_IPC2R2_WLRU_B_0X0			(0x0u<<16)
#define	DCMIPP_IPC2R2_WLRU_B_0X1			(0x1u<<16)

// IPC2R3 Configuration

#define	DCMIPP_IPC2R3_DPREGEND				(0x3FFu<<16)
#define	DCMIPP_IPC2R3_DPREGEND_0			(0x1u<<16)
#define	DCMIPP_IPC2R3_DPREGSTART			(0x3FFu<<0)
#define	DCMIPP_IPC2R3_DPREGSTART_0			(0x1u<<0)

// IPC3R1 Configuration

#define	DCMIPP_IPC3R1_OTR					(0xFu<<8)
#define	DCMIPP_IPC3R1_OTR_0					(0x1u<<8)
#define	DCMIPP_IPC3R1_TRAFFIC				(0x7u<<0)
#define	DCMIPP_IPC3R1_TRAFFIC_0				(0x1u<<0)

#define	DCMIPP_IPC3R1_OTR_B_0X0				(0x0u<<8)
#define	DCMIPP_IPC3R1_OTR_B_0X1				(0x1u<<8)
#define	DCMIPP_IPC3R1_TRAFFIC_B_0X0			(0x0u<<0)
#define	DCMIPP_IPC3R1_TRAFFIC_B_0X1			(0x1u<<0)

// IPC3R2 Configuration

#define	DCMIPP_IPC3R2_WLRU					(0xFu<<16)
#define	DCMIPP_IPC3R2_WLRU_0				(0x1u<<16)
#define	DCMIPP_IPC3R2_SVCMAPPING			(0xFu<<8)
#define	DCMIPP_IPC3R2_SVCMAPPING_0			(0x1u<<8)

#define	DCMIPP_IPC3R2_WLRU_B_0X0			(0x0u<<16)
#define	DCMIPP_IPC3R2_WLRU_B_0X1			(0x1u<<16)

// IPC3R3 Configuration

#define	DCMIPP_IPC3R3_DPREGEND				(0x3FFu<<16)
#define	DCMIPP_IPC3R3_DPREGEND_0			(0x1u<<16)
#define	DCMIPP_IPC3R3_DPREGSTART			(0x3FFu<<0)
#define	DCMIPP_IPC3R3_DPREGSTART_0			(0x1u<<0)

// IPC4R1 Configuration

#define	DCMIPP_IPC4R1_OTR					(0xFu<<8)
#define	DCMIPP_IPC4R1_OTR_0					(0x1u<<8)
#define	DCMIPP_IPC4R1_TRAFFIC				(0x7u<<0)
#define	DCMIPP_IPC4R1_TRAFFIC_0				(0x1u<<0)

#define	DCMIPP_IPC4R1_OTR_B_0X0				(0x0u<<8)
#define	DCMIPP_IPC4R1_OTR_B_0X1				(0x1u<<8)
#define	DCMIPP_IPC4R1_TRAFFIC_B_0X0			(0x0u<<0)
#define	DCMIPP_IPC4R1_TRAFFIC_B_0X1			(0x1u<<0)

// IPC4R2 Configuration

#define	DCMIPP_IPC4R2_WLRU					(0xFu<<16)
#define	DCMIPP_IPC4R2_WLRU_0				(0x1u<<16)
#define	DCMIPP_IPC4R2_SVCMAPPING			(0xFu<<8)
#define	DCMIPP_IPC4R2_SVCMAPPING_0			(0x1u<<8)

#define	DCMIPP_IPC4R2_WLRU_B_0X0			(0x0u<<16)
#define	DCMIPP_IPC4R2_WLRU_B_0X1			(0x1u<<16)

// IPC4R3 Configuration

#define	DCMIPP_IPC4R3_DPREGEND				(0x3FFu<<16)
#define	DCMIPP_IPC4R3_DPREGEND_0			(0x1u<<16)
#define	DCMIPP_IPC4R3_DPREGSTART			(0x3FFu<<0)
#define	DCMIPP_IPC4R3_DPREGSTART_0			(0x1u<<0)

// IPC5R1 Configuration

#define	DCMIPP_IPC5R1_OTR					(0xFu<<8)
#define	DCMIPP_IPC5R1_OTR_0					(0x1u<<8)
#define	DCMIPP_IPC5R1_TRAFFIC				(0x7u<<0)
#define	DCMIPP_IPC5R1_TRAFFIC_0				(0x1u<<0)

#define	DCMIPP_IPC5R1_OTR_B_0X0				(0x0u<<8)
#define	DCMIPP_IPC5R1_OTR_B_0X1				(0x1u<<8)
#define	DCMIPP_IPC5R1_TRAFFIC_B_0X0			(0x0u<<0)
#define	DCMIPP_IPC5R1_TRAFFIC_B_0X1			(0x1u<<0)

// IPC5R2 Configuration

#define	DCMIPP_IPC5R2_WLRU					(0xFu<<16)
#define	DCMIPP_IPC5R2_WLRU_0				(0x1u<<16)
#define	DCMIPP_IPC5R2_SVCMAPPING			(0xFu<<8)
#define	DCMIPP_IPC5R2_SVCMAPPING_0			(0x1u<<8)

#define	DCMIPP_IPC5R2_WLRU_B_0X0			(0x0u<<16)
#define	DCMIPP_IPC5R2_WLRU_B_0X1			(0x1u<<16)

// IPC5R3 Configuration

#define	DCMIPP_IPC5R3_DPREGEND				(0x3FFu<<16)
#define	DCMIPP_IPC5R3_DPREGEND_0			(0x1u<<16)
#define	DCMIPP_IPC5R3_DPREGSTART			(0x3FFu<<0)
#define	DCMIPP_IPC5R3_DPREGSTART_0			(0x1u<<0)

// PRCR Configuration

#define	DCMIPP_PRCR_SWAPBITS				(0x1u<<26)
#define	DCMIPP_PRCR_SWAPCYCLES				(0x1u<<25)
#define	DCMIPP_PRCR_FORMAT					(0xFFu<<16)
#define	DCMIPP_PRCR_FORMAT_0				(0x1u<<16)
#define	DCMIPP_PRCR_ENABLE					(0x1u<<14)
#define	DCMIPP_PRCR_EDM						(0x7u<<10)
#define	DCMIPP_PRCR_EDM_0					(0x1u<<10)
#define	DCMIPP_PRCR_VSPOL					(0x1u<<7)
#define	DCMIPP_PRCR_HSPOL					(0x1u<<6)
#define	DCMIPP_PRCR_PCKPOL					(0x1u<<5)
#define	DCMIPP_PRCR_ESS						(0x1u<<4)

#define	DCMIPP_PRCR_SWAPBITS_B_0X0			(0x0u<<26)
#define	DCMIPP_PRCR_SWAPBITS_B_0X1			(0x1u<<26)
#define	DCMIPP_PRCR_SWAPCYCLES_B_0X0		(0x0u<<25)
#define	DCMIPP_PRCR_SWAPCYCLES_B_0X1		(0x1u<<25)
#define	DCMIPP_PRCR_FORMAT_B_0X1E			(0x1Eu<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X22			(0x22u<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X24			(0x24u<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X2A			(0x2Au<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X2B			(0x2Bu<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X2C			(0x2Cu<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X2D			(0x2Du<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X4A			(0x4Au<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X4B			(0x4Bu<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X4C			(0x4Cu<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X4D			(0x4Du<<16)
#define	DCMIPP_PRCR_FORMAT_B_0X5A			(0x5Au<<16)
#define	DCMIPP_PRCR_ENABLE_B_0X0			(0x0u<<14)
#define	DCMIPP_PRCR_ENABLE_B_0X1			(0x1u<<14)
#define	DCMIPP_PRCR_EDM_B_0X0				(0x0u<<10)
#define	DCMIPP_PRCR_EDM_B_0X1				(0x1u<<10)
#define	DCMIPP_PRCR_EDM_B_0X2				(0x2u<<10)
#define	DCMIPP_PRCR_EDM_B_0X3				(0x3u<<10)
#define	DCMIPP_PRCR_EDM_B_0X4				(0x4u<<10)
#define	DCMIPP_PRCR_VSPOL_B_0X0				(0x0u<<7)
#define	DCMIPP_PRCR_VSPOL_B_0X1				(0x1u<<7)
#define	DCMIPP_PRCR_HSPOL_B_0X0				(0x0u<<6)
#define	DCMIPP_PRCR_HSPOL_B_0X1				(0x1u<<6)
#define	DCMIPP_PRCR_PCKPOL_B_0X0			(0x0u<<5)
#define	DCMIPP_PRCR_PCKPOL_B_0X1			(0x1u<<5)
#define	DCMIPP_PRCR_ESS_B_0X0				(0x0u<<4)
#define	DCMIPP_PRCR_ESS_B_0X1				(0x1u<<4)

// PRESCR Configuration

