hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_PRESCR_FEC					(0xFFu<<24)
#define	DCMIPP_PRESCR_FEC_0					(0x1u<<24)
#define	DCMIPP_PRESCR_LEC					(0xFFu<<16)
#define	DCMIPP_PRESCR_LEC_0					(0x1u<<16)
#define	DCMIPP_PRESCR_LSC					(0xFFu<<8)
#define	DCMIPP_PRESCR_LSC_0					(0x1u<<8)
#define	DCMIPP_PRESCR_FSC					(0xFFu<<0)
#define	DCMIPP_PRESCR_FSC_0					(0x1u<<0)

// PRESUR Configuration

#define	DCMIPP_PRESUR_FEU					(0xFFu<<24)
#define	DCMIPP_PRESUR_FEU_0					(0x1u<<24)
#define	DCMIPP_PRESUR_LEU					(0xFFu<<16)
#define	DCMIPP_PRESUR_LEU_0					(0x1u<<16)
#define	DCMIPP_PRESUR_LSU					(0xFFu<<8)
#define	DCMIPP_PRESUR_LSU_0					(0x1u<<8)
#define	DCMIPP_PRESUR_FSU					(0xFFu<<0)
#define	DCMIPP_PRESUR_FSU_0					(0x1u<<0)

#define	DCMIPP_PRESUR_FEU_B_0X0				(0x0u<<24)
#define	DCMIPP_PRESUR_FEU_B_0X1				(0x1u<<24)
#define	DCMIPP_PRESUR_LEU_B_0X0				(0x0u<<16)
#define	DCMIPP_PRESUR_LEU_B_0X1				(0x1u<<16)
#define	DCMIPP_PRESUR_LSU_B_0X0				(0x0u<<8)
#define	DCMIPP_PRESUR_LSU_B_0X1				(0x1u<<8)
#define	DCMIPP_PRESUR_FSU_B_0X0				(0x0u<<0)
#define	DCMIPP_PRESUR_FSU_B_0X1				(0x1u<<0)

// PRIER Configuration

#define	DCMIPP_PRIER_ERRIE					(0x1u<<6)

#define	DCMIPP_PRIER_ERRIE_B_0X0			(0x0u<<6)
#define	DCMIPP_PRIER_ERRIE_B_0X1			(0x1u<<6)

// PRSR Configuration

#define	DCMIPP_PRSR_VSYNC					(0x1u<<17)
#define	DCMIPP_PRSR_HSYNC					(0x1u<<16)
#define	DCMIPP_PRSR_ERRF					(0x1u<<6)

#define	DCMIPP_PRSR_VSYNC_B_0X0				(0x0u<<17)
#define	DCMIPP_PRSR_VSYNC_B_0X1				(0x1u<<17)
#define	DCMIPP_PRSR_HSYNC_B_0X0				(0x0u<<16)
#define	DCMIPP_PRSR_HSYNC_B_0X1				(0x1u<<16)
#define	DCMIPP_PRSR_ERRF_B_0X0				(0x0u<<6)
#define	DCMIPP_PRSR_ERRF_B_0X1				(0x1u<<6)

// PRFCR Configuration

#define	DCMIPP_PRFCR_CERRF					(0x1u<<6)

// CMCR Configuration

#define	DCMIPP_CMCR_SWAPRB					(0x1u<<7)
#define	DCMIPP_CMCR_CFC						(0x1u<<4)
#define	DCMIPP_CMCR_PSFC					(0x3u<<1)
#define	DCMIPP_CMCR_PSFC_0					(0x1u<<1)
#define	DCMIPP_CMCR_INSEL					(0x1u<<0)

#define	DCMIPP_CMCR_SWAPRB_B_0X0			(0x0u<<7)
#define	DCMIPP_CMCR_SWAPRB_B_0X1			(0x1u<<7)
#define	DCMIPP_CMCR_PSFC_B_0X0				(0x0u<<1)
#define	DCMIPP_CMCR_PSFC_B_0X1				(0x1u<<1)
#define	DCMIPP_CMCR_PSFC_B_0X2				(0x2u<<1)
#define	DCMIPP_CMCR_INSEL_B_0X0				(0x0u<<0)
#define	DCMIPP_CMCR_INSEL_B_0X1				(0x1u<<0)

// CMFRCR Configuration

#define	DCMIPP_CMFRCR_FRMCNT				(0xFFFFFFFFu<<0)
#define	DCMIPP_CMFRCR_FRMCNT_0				(0x1u<<0)

// CMIER Configuration

#define	DCMIPP_CMIER_P2OVRIE				(0x1u<<31)
#define	DCMIPP_CMIER_P2VSYNCIE				(0x1u<<26)
#define	DCMIPP_CMIER_P2FRAMEIE				(0x1u<<25)
#define	DCMIPP_CMIER_P2LINEIE				(0x1u<<24)
#define	DCMIPP_CMIER_P1OVRIE				(0x1u<<23)
#define	DCMIPP_CMIER_P1VSYNCIE				(0x1u<<18)
#define	DCMIPP_CMIER_P1FRAMEIE				(0x1u<<17)
#define	DCMIPP_CMIER_P1LINEIE				(0x1u<<16)
#define	DCMIPP_CMIER_P0OVRIE				(0x1u<<15)
#define	DCMIPP_CMIER_P0LIMITIE				(0x1u<<14)
#define	DCMIPP_CMIER_P0VSYNCIE				(0x1u<<10)
#define	DCMIPP_CMIER_P0FRAMEIE				(0x1u<<9)
#define	DCMIPP_CMIER_P0LINEIE				(0x1u<<8)
#define	DCMIPP_CMIER_PRERRIE				(0x1u<<6)
#define	DCMIPP_CMIER_ATXERRIE				(0x1u<<5)

#define	DCMIPP_CMIER_P2OVRIE_B_0X0			(0x0u<<31)
#define	DCMIPP_CMIER_P2OVRIE_B_0X1			(0x1u<<31)
#define	DCMIPP_CMIER_P2VSYNCIE_B_0X0		(0x0u<<26)
#define	DCMIPP_CMIER_P2VSYNCIE_B_0X1		(0x1u<<26)
#define	DCMIPP_CMIER_P2FRAMEIE_B_0X0		(0x0u<<25)
#define	DCMIPP_CMIER_P2FRAMEIE_B_0X1		(0x1u<<25)
#define	DCMIPP_CMIER_P2LINEIE_B_0X0			(0x0u<<24)
#define	DCMIPP_CMIER_P2LINEIE_B_0X1			(0x1u<<24)
#define	DCMIPP_CMIER_P1VSYNCIE_B_0X0		(0x0u<<18)
#define	DCMIPP_CMIER_P1VSYNCIE_B_0X1		(0x1u<<18)
#define	DCMIPP_CMIER_P1FRAMEIE_B_0X0		(0x0u<<17)
#define	DCMIPP_CMIER_P1FRAMEIE_B_0X1		(0x1u<<17)
#define	DCMIPP_CMIER_P1LINEIE_B_0X0			(0x0u<<16)
#define	DCMIPP_CMIER_P1LINEIE_B_0X1			(0x1u<<16)
#define	DCMIPP_CMIER_P0OVRIE_B_0X0			(0x0u<<15)
#define	DCMIPP_CMIER_P0OVRIE_B_0X1			(0x1u<<15)
#define	DCMIPP_CMIER_P0LIMITIE_B_0X0		(0x0u<<14)
#define	DCMIPP_CMIER_P0LIMITIE_B_0X1		(0x1u<<14)
#define	DCMIPP_CMIER_P0VSYNCIE_B_0X0		(0x0u<<10)
#define	DCMIPP_CMIER_P0VSYNCIE_B_0X1		(0x1u<<10)
#define	DCMIPP_CMIER_P0FRAMEIE_B_0X0		(0x0u<<9)
#define	DCMIPP_CMIER_P0FRAMEIE_B_0X1		(0x1u<<9)
#define	DCMIPP_CMIER_P0LINEIE_B_0X0			(0x0u<<8)
#define	DCMIPP_CMIER_P0LINEIE_B_0X1			(0x1u<<8)
#define	DCMIPP_CMIER_PRERRIE_B_0X0			(0x0u<<6)
#define	DCMIPP_CMIER_PRERRIE_B_0X1			(0x1u<<6)
#define	DCMIPP_CMIER_ATXERRIE_B_0X0			(0x0u<<5)
#define	DCMIPP_CMIER_ATXERRIE_B_0X1			(0x1u<<5)

// CMSR1 Configuration

#define	DCMIPP_CMSR1_P2CPTACT				(0x1u<<31)
#define	DCMIPP_CMSR1_P2LSTFRM				(0x1u<<25)
#define	DCMIPP_CMSR1_P2LSTLINE				(0x1u<<24)
#define	DCMIPP_CMSR1_P1CPTACT				(0x1u<<23)
#define	DCMIPP_CMSR1_P1LSTFRM				(0x1u<<17)
#define	DCMIPP_CMSR1_P1LSTLINE				(0x1u<<16)
#define	DCMIPP_CMSR1_P0CPTACT				(0x1u<<15)
#define	DCMIPP_CMSR1_P0LSTFRM				(0x1u<<9)
#define	DCMIPP_CMSR1_P0LSTLINE				(0x1u<<8)
#define	DCMIPP_CMSR1_PRVSYNC				(0x1u<<1)
#define	DCMIPP_CMSR1_PRHSYNC				(0x1u<<0)

#define	DCMIPP_CMSR1_P2CPTACT_B_0X0			(0x0u<<31)
#define	DCMIPP_CMSR1_P2CPTACT_B_0X1			(0x1u<<31)
#define	DCMIPP_CMSR1_P1CPTACT_B_0X0			(0x0u<<23)
#define	DCMIPP_CMSR1_P1CPTACT_B_0X1			(0x1u<<23)
#define	DCMIPP_CMSR1_P0CPTACT_B_0X0			(0x0u<<15)
#define	DCMIPP_CMSR1_P0CPTACT_B_0X1			(0x1u<<15)
#define	DCMIPP_CMSR1_PRVSYNC_B_0X0			(0x0u<<1)
#define	DCMIPP_CMSR1_PRVSYNC_B_0X1			(0x1u<<1)
#define	DCMIPP_CMSR1_PRHSYNC_B_0X0			(0x0u<<0)
#define	DCMIPP_CMSR1_PRHSYNC_B_0X1			(0x1u<<0)

// CMSR2 Configuration

#define	DCMIPP_CMSR2_P2OVRF					(0x1u<<31)
#define	DCMIPP_CMSR2_P2VSYNCF				(0x1u<<26)
#define	DCMIPP_CMSR2_P2FRAMEF				(0x1u<<25)
#define	DCMIPP_CMSR2_P2LINEF				(0x1u<<24)
#define	DCMIPP_CMSR2_P1OVRF					(0x1u<<23)
#define	DCMIPP_CMSR2_P1VSYNCF				(0x1u<<18)
#define	DCMIPP_CMSR2_P1FRAMEF				(0x1u<<17)
#define	DCMIPP_CMSR2_P1LINEF				(0x1u<<16)
#define	DCMIPP_CMSR2_P0OVRF					(0x1u<<15)
#define	DCMIPP_CMSR2_P0LIMITF				(0x1u<<14)
#define	DCMIPP_CMSR2_P0VSYNCF				(0x1u<<10)
#define	DCMIPP_CMSR2_P0FRAMEF				(0x1u<<9)
#define	DCMIPP_CMSR2_P0LINEF				(0x1u<<8)
#define	DCMIPP_CMSR2_PRERRF					(0x1u<<6)
#define	DCMIPP_CMSR2_ATXERRF				(0x1u<<5)

#define	DCMIPP_CMSR2_P2OVRF_B_0X0			(0x0u<<31)
#define	DCMIPP_CMSR2_P2OVRF_B_0X1			(0x1u<<31)
#define	DCMIPP_CMSR2_P2FRAMEF_B_0X0			(0x0u<<25)
#define	DCMIPP_CMSR2_P2FRAMEF_B_0X1			(0x1u<<25)
#define	DCMIPP_CMSR2_P1OVRF_B_0X0			(0x0u<<23)
#define	DCMIPP_CMSR2_P1OVRF_B_0X1			(0x1u<<23)
#define	DCMIPP_CMSR2_P1FRAMEF_B_0X0			(0x0u<<17)
#define	DCMIPP_CMSR2_P1FRAMEF_B_0X1			(0x1u<<17)
#define	DCMIPP_CMSR2_P0OVRF_B_0X0			(0x0u<<15)
#define	DCMIPP_CMSR2_P0OVRF_B_0X1			(0x1u<<15)
#define	DCMIPP_CMSR2_P0FRAMEF_B_0X0			(0x0u<<9)
#define	DCMIPP_CMSR2_P0FRAMEF_B_0X1			(0x1u<<9)
#define	DCMIPP_CMSR2_PRERRF_B_0X0			(0x0u<<6)
#define	DCMIPP_CMSR2_PRERRF_B_0X1			(0x1u<<6)
#define	DCMIPP_CMSR2_ATXERRF_B_0X0			(0x0u<<5)
#define	DCMIPP_CMSR2_ATXERRF_B_0X1			(0x1u<<5)

// CMFCR Configuration

