hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_CMFCR_CP2OVRF				(0x1u<<31)
#define	DCMIPP_CMFCR_CP2VSYNCF				(0x1u<<26)
#define	DCMIPP_CMFCR_CP2FRAMEF				(0x1u<<25)
#define	DCMIPP_CMFCR_CP2LINEF				(0x1u<<24)
#define	DCMIPP_CMFCR_CP1OVRF				(0x1u<<23)
#define	DCMIPP_CMFCR_CP1VSYNCF				(0x1u<<18)
#define	DCMIPP_CMFCR_CP1FRAMEF				(0x1u<<17)
#define	DCMIPP_CMFCR_CP1LINEF				(0x1u<<16)
#define	DCMIPP_CMFCR_CP0OVRF				(0x1u<<15)
#define	DCMIPP_CMFCR_CP0LIMITF				(0x1u<<14)
#define	DCMIPP_CMFCR_CP0VSYNCF				(0x1u<<10)
#define	DCMIPP_CMFCR_CP0FRAMEF				(0x1u<<9)
#define	DCMIPP_CMFCR_CP0LINEF				(0x1u<<8)
#define	DCMIPP_CMFCR_CPRERRF				(0x1u<<6)
#define	DCMIPP_CMFCR_CATXERRF				(0x1u<<5)

// P0FSCR Configuration

#define	DCMIPP_P0FSCR_PIPEN					(0x1u<<31)
#define	DCMIPP_P0FSCR_VC					(0x3u<<19)
#define	DCMIPP_P0FSCR_VC_0					(0x1u<<19)
#define	DCMIPP_P0FSCR_DTMODE				(0x3u<<16)
#define	DCMIPP_P0FSCR_DTMODE_0				(0x1u<<16)
#define	DCMIPP_P0FSCR_DTIDB					(0x3Fu<<8)
#define	DCMIPP_P0FSCR_DTIDB_0				(0x1u<<8)
#define	DCMIPP_P0FSCR_DTIDA					(0x3Fu<<0)
#define	DCMIPP_P0FSCR_DTIDA_0				(0x1u<<0)

#define	DCMIPP_P0FSCR_PIPEN_B_0X0			(0x0u<<31)
#define	DCMIPP_P0FSCR_PIPEN_B_0X1			(0x1u<<31)
#define	DCMIPP_P0FSCR_DTMODE_B_0X0			(0x0u<<16)
#define	DCMIPP_P0FSCR_DTMODE_B_0X1			(0x1u<<16)
#define	DCMIPP_P0FSCR_DTMODE_B_0X2			(0x2u<<16)
#define	DCMIPP_P0FSCR_DTMODE_B_0X3			(0x3u<<16)

// P0FCTCR Configuration

#define	DCMIPP_P0FCTCR_CPTREQ				(0x1u<<3)
#define	DCMIPP_P0FCTCR_CPTMODE				(0x1u<<2)
#define	DCMIPP_P0FCTCR_FRATE				(0x3u<<0)
#define	DCMIPP_P0FCTCR_FRATE_0				(0x1u<<0)

#define	DCMIPP_P0FCTCR_CPTREQ_B_0X0			(0x0u<<3)
#define	DCMIPP_P0FCTCR_CPTREQ_B_0X1			(0x1u<<3)
#define	DCMIPP_P0FCTCR_CPTMODE_B_0X0		(0x0u<<2)
#define	DCMIPP_P0FCTCR_CPTMODE_B_0X1		(0x1u<<2)
#define	DCMIPP_P0FCTCR_FRATE_B_0X0			(0x0u<<0)
#define	DCMIPP_P0FCTCR_FRATE_B_0X1			(0x1u<<0)
#define	DCMIPP_P0FCTCR_FRATE_B_0X2			(0x2u<<0)
#define	DCMIPP_P0FCTCR_FRATE_B_0X3			(0x3u<<0)

// P0SCSTR Configuration

#define	DCMIPP_P0SCSTR_VSTART				(0xFFFu<<16)
#define	DCMIPP_P0SCSTR_VSTART_0				(0x1u<<16)
#define	DCMIPP_P0SCSTR_HSTART				(0xFFFu<<0)
#define	DCMIPP_P0SCSTR_HSTART_0				(0x1u<<0)

// P0SCSZR Configuration

#define	DCMIPP_P0SCSZR_ENABLE				(0x1u<<31)
#define	DCMIPP_P0SCSZR_POSNEG				(0x1u<<30)
#define	DCMIPP_P0SCSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P0SCSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P0SCSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P0SCSZR_HSIZE_0				(0x1u<<0)

#define	DCMIPP_P0SCSZR_ENABLE_B_0X0			(0x0u<<31)
#define	DCMIPP_P0SCSZR_ENABLE_B_0X1			(0x1u<<31)
#define	DCMIPP_P0SCSZR_POSNEG_B_0X0			(0x0u<<30)
#define	DCMIPP_P0SCSZR_POSNEG_B_0X1			(0x1u<<30)

// P0DCCNTR Configuration

#define	DCMIPP_P0DCCNTR_CNT					(0x3FFFFFFu<<0)
#define	DCMIPP_P0DCCNTR_CNT_0				(0x1u<<0)

// P0DCLMTR Configuration

#define	DCMIPP_P0DCLMTR_ENABLE				(0x1u<<31)
#define	DCMIPP_P0DCLMTR_LIMIT				(0xFFFFFFu<<0)
#define	DCMIPP_P0DCLMTR_LIMIT_0				(0x1u<<0)

#define	DCMIPP_P0DCLMTR_ENABLE_B_0X0		(0x0u<<31)
#define	DCMIPP_P0DCLMTR_ENABLE_B_0X1		(0x1u<<31)

// P0PPCR Configuration

#define	DCMIPP_P0PPCR_DBM					(0x1u<<16)
#define	DCMIPP_P0PPCR_LINEMULT				(0x7u<<13)
#define	DCMIPP_P0PPCR_LINEMULT_0			(0x1u<<13)
#define	DCMIPP_P0PPCR_OELS					(0x1u<<11)
#define	DCMIPP_P0PPCR_LSM					(0x1u<<10)
#define	DCMIPP_P0PPCR_OEBS					(0x1u<<9)
#define	DCMIPP_P0PPCR_BSM					(0x3u<<7)
#define	DCMIPP_P0PPCR_BSM_0					(0x1u<<7)
#define	DCMIPP_P0PPCR_HEADEREN				(0x1u<<6)
#define	DCMIPP_P0PPCR_PAD					(0x1u<<5)
#define	DCMIPP_P0PPCR_SWAPYUV				(0x1u<<0)

#define	DCMIPP_P0PPCR_DBM_B_0X0				(0x0u<<16)
#define	DCMIPP_P0PPCR_DBM_B_0X1				(0x1u<<16)
#define	DCMIPP_P0PPCR_LINEMULT_B_0X0		(0x0u<<13)
#define	DCMIPP_P0PPCR_LINEMULT_B_0X1		(0x1u<<13)
#define	DCMIPP_P0PPCR_LINEMULT_B_0X2		(0x2u<<13)
#define	DCMIPP_P0PPCR_LINEMULT_B_0X3		(0x3u<<13)
#define	DCMIPP_P0PPCR_LINEMULT_B_0X4		(0x4u<<13)
#define	DCMIPP_P0PPCR_LINEMULT_B_0X5		(0x5u<<13)
#define	DCMIPP_P0PPCR_LINEMULT_B_0X6		(0x6u<<13)
#define	DCMIPP_P0PPCR_LINEMULT_B_0X7		(0x7u<<13)
#define	DCMIPP_P0PPCR_OELS_B_0X0			(0x0u<<11)
#define	DCMIPP_P0PPCR_OELS_B_0X1			(0x1u<<11)
#define	DCMIPP_P0PPCR_LSM_B_0X0				(0x0u<<10)
#define	DCMIPP_P0PPCR_LSM_B_0X1				(0x1u<<10)
#define	DCMIPP_P0PPCR_OEBS_B_0X0			(0x0u<<9)
#define	DCMIPP_P0PPCR_OEBS_B_0X1			(0x1u<<9)
#define	DCMIPP_P0PPCR_BSM_B_0X0				(0x0u<<7)
#define	DCMIPP_P0PPCR_BSM_B_0X1				(0x1u<<7)
#define	DCMIPP_P0PPCR_BSM_B_0X2				(0x2u<<7)
#define	DCMIPP_P0PPCR_BSM_B_0X3				(0x3u<<7)
#define	DCMIPP_P0PPCR_HEADEREN_B_0X0		(0x0u<<6)
#define	DCMIPP_P0PPCR_HEADEREN_B_0X1		(0x1u<<6)
#define	DCMIPP_P0PPCR_PAD_B_0X0				(0x0u<<5)
#define	DCMIPP_P0PPCR_PAD_B_0X1				(0x1u<<5)
#define	DCMIPP_P0PPCR_SWAPYUV_B_0X0			(0x0u<<0)
#define	DCMIPP_P0PPCR_SWAPYUV_B_0X1			(0x1u<<0)

// P0PPM0AR1 Configuration

#define	DCMIPP_P0PPM0AR1_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P0PPM0AR1_M0A_0				(0x1u<<0)

// P0PPM0AR2 Configuration

#define	DCMIPP_P0PPM0AR2_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P0PPM0AR2_M0A_0				(0x1u<<0)

// P0STM0AR Configuration

#define	DCMIPP_P0STM0AR_M0A					(0xFFFFFFFFu<<0)
#define	DCMIPP_P0STM0AR_M0A_0				(0x1u<<0)

// P0IER Configuration

#define	DCMIPP_P0IER_OVRIE					(0x1u<<7)
#define	DCMIPP_P0IER_LIMITIE				(0x1u<<6)
#define	DCMIPP_P0IER_VSYNCIE				(0x1u<<2)
#define	DCMIPP_P0IER_FRAMEIE				(0x1u<<1)
#define	DCMIPP_P0IER_LINEIE					(0x1u<<0)

#define	DCMIPP_P0IER_OVRIE_B_0X0			(0x0u<<7)
#define	DCMIPP_P0IER_OVRIE_B_0X1			(0x1u<<7)
#define	DCMIPP_P0IER_LIMITIE_B_0X0			(0x0u<<6)
#define	DCMIPP_P0IER_LIMITIE_B_0X1			(0x1u<<6)
#define	DCMIPP_P0IER_VSYNCIE_B_0X0			(0x0u<<2)
#define	DCMIPP_P0IER_VSYNCIE_B_0X1			(0x1u<<2)
#define	DCMIPP_P0IER_FRAMEIE_B_0X0			(0x0u<<1)
#define	DCMIPP_P0IER_FRAMEIE_B_0X1			(0x1u<<1)
#define	DCMIPP_P0IER_LINEIE_B_0X0			(0x0u<<0)
#define	DCMIPP_P0IER_LINEIE_B_0X1			(0x1u<<0)

// P0SR Configuration

#define	DCMIPP_P0SR_CPTACT					(0x1u<<23)
#define	DCMIPP_P0SR_LSTFRM					(0x1u<<17)
#define	DCMIPP_P0SR_LSTLINE					(0x1u<<16)
#define	DCMIPP_P0SR_OVRF					(0x1u<<7)
#define	DCMIPP_P0SR_LIMITF					(0x1u<<6)
#define	DCMIPP_P0SR_VSYNCF					(0x1u<<2)
#define	DCMIPP_P0SR_FRAMEF					(0x1u<<1)
#define	DCMIPP_P0SR_LINEF					(0x1u<<0)

