hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_P0SR_CPTACT_B_0X0			(0x0u<<23)
#define	DCMIPP_P0SR_CPTACT_B_0X1			(0x1u<<23)
#define	DCMIPP_P0SR_OVRF_B_0X0				(0x0u<<7)
#define	DCMIPP_P0SR_OVRF_B_0X1				(0x1u<<7)
#define	DCMIPP_P0SR_FRAMEF_B_0X0			(0x0u<<1)
#define	DCMIPP_P0SR_FRAMEF_B_0X1			(0x1u<<1)

// P0FCR Configuration

#define	DCMIPP_P0FCR_COVRF					(0x1u<<7)
#define	DCMIPP_P0FCR_CLIMITF				(0x1u<<6)
#define	DCMIPP_P0FCR_CVSYNCF				(0x1u<<2)
#define	DCMIPP_P0FCR_CFRAMEF				(0x1u<<1)
#define	DCMIPP_P0FCR_CLINEF					(0x1u<<0)

// P0CFSCR Configuration

#define	DCMIPP_P0CFSCR_PIPEN				(0x1u<<31)
#define	DCMIPP_P0CFSCR_VC					(0x3u<<19)
#define	DCMIPP_P0CFSCR_VC_0					(0x1u<<19)
#define	DCMIPP_P0CFSCR_DTMODE				(0x3u<<16)
#define	DCMIPP_P0CFSCR_DTMODE_0				(0x1u<<16)
#define	DCMIPP_P0CFSCR_DTIDB				(0x3Fu<<8)
#define	DCMIPP_P0CFSCR_DTIDB_0				(0x1u<<8)
#define	DCMIPP_P0CFSCR_DTIDA				(0x3Fu<<0)
#define	DCMIPP_P0CFSCR_DTIDA_0				(0x1u<<0)

#define	DCMIPP_P0CFSCR_PIPEN_B_0X0			(0x0u<<31)
#define	DCMIPP_P0CFSCR_PIPEN_B_0X1			(0x1u<<31)
#define	DCMIPP_P0CFSCR_DTMODE_B_0X0			(0x0u<<16)
#define	DCMIPP_P0CFSCR_DTMODE_B_0X1			(0x1u<<16)
#define	DCMIPP_P0CFSCR_DTMODE_B_0X2			(0x2u<<16)
#define	DCMIPP_P0CFSCR_DTMODE_B_0X3			(0x3u<<16)

// P0CFCTCR Configuration

#define	DCMIPP_P0CFCTCR_CPTREQ				(0x1u<<3)
#define	DCMIPP_P0CFCTCR_CPTMODE				(0x1u<<2)
#define	DCMIPP_P0CFCTCR_FRATE				(0x3u<<0)
#define	DCMIPP_P0CFCTCR_FRATE_0				(0x1u<<0)

#define	DCMIPP_P0CFCTCR_CPTREQ_B_0X0		(0x0u<<3)
#define	DCMIPP_P0CFCTCR_CPTREQ_B_0X1		(0x1u<<3)
#define	DCMIPP_P0CFCTCR_CPTMODE_B_0X0		(0x0u<<2)
#define	DCMIPP_P0CFCTCR_CPTMODE_B_0X1		(0x1u<<2)
#define	DCMIPP_P0CFCTCR_FRATE_B_0X0			(0x0u<<0)
#define	DCMIPP_P0CFCTCR_FRATE_B_0X1			(0x1u<<0)
#define	DCMIPP_P0CFCTCR_FRATE_B_0X2			(0x2u<<0)
#define	DCMIPP_P0CFCTCR_FRATE_B_0X3			(0x3u<<0)

// P0CSCSTR Configuration

#define	DCMIPP_P0CSCSTR_VSTART				(0xFFFu<<16)
#define	DCMIPP_P0CSCSTR_VSTART_0			(0x1u<<16)
#define	DCMIPP_P0CSCSTR_HSTART				(0xFFFu<<0)
#define	DCMIPP_P0CSCSTR_HSTART_0			(0x1u<<0)

// P0CSCSZR Configuration

#define	DCMIPP_P0CSCSZR_ENABLE				(0x1u<<31)
#define	DCMIPP_P0CSCSZR_POSNEG				(0x1u<<30)
#define	DCMIPP_P0CSCSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P0CSCSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P0CSCSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P0CSCSZR_HSIZE_0				(0x1u<<0)

#define	DCMIPP_P0CSCSZR_ENABLE_B_0X0		(0x0u<<31)
#define	DCMIPP_P0CSCSZR_ENABLE_B_0X1		(0x1u<<31)
#define	DCMIPP_P0CSCSZR_POSNEG_B_0X0		(0x0u<<30)
#define	DCMIPP_P0CSCSZR_POSNEG_B_0X1		(0x1u<<30)

// P0CPPCR Configuration

#define	DCMIPP_P0CPPCR_DBM					(0x1u<<16)
#define	DCMIPP_P0CPPCR_LINEMULT				(0x7u<<13)
#define	DCMIPP_P0CPPCR_LINEMULT_0			(0x1u<<13)
#define	DCMIPP_P0CPPCR_OELS					(0x1u<<11)
#define	DCMIPP_P0CPPCR_LSM					(0x1u<<10)
#define	DCMIPP_P0CPPCR_OEBS					(0x1u<<9)
#define	DCMIPP_P0CPPCR_BSM					(0x3u<<7)
#define	DCMIPP_P0CPPCR_BSM_0				(0x1u<<7)
#define	DCMIPP_P0CPPCR_HEADEREN				(0x1u<<6)
#define	DCMIPP_P0CPPCR_PAD					(0x1u<<5)
#define	DCMIPP_P0CPPCR_SWAPYUV				(0x1u<<0)

#define	DCMIPP_P0CPPCR_DBM_B_0X0			(0x0u<<16)
#define	DCMIPP_P0CPPCR_DBM_B_0X1			(0x1u<<16)
#define	DCMIPP_P0CPPCR_LINEMULT_B_0X0		(0x0u<<13)
#define	DCMIPP_P0CPPCR_LINEMULT_B_0X1		(0x1u<<13)
#define	DCMIPP_P0CPPCR_LINEMULT_B_0X2		(0x2u<<13)
#define	DCMIPP_P0CPPCR_LINEMULT_B_0X3		(0x3u<<13)
#define	DCMIPP_P0CPPCR_LINEMULT_B_0X4		(0x4u<<13)
#define	DCMIPP_P0CPPCR_LINEMULT_B_0X5		(0x5u<<13)
#define	DCMIPP_P0CPPCR_LINEMULT_B_0X6		(0x6u<<13)
#define	DCMIPP_P0CPPCR_LINEMULT_B_0X7		(0x7u<<13)
#define	DCMIPP_P0CPPCR_OELS_B_0X0			(0x0u<<11)
#define	DCMIPP_P0CPPCR_OELS_B_0X1			(0x1u<<11)
#define	DCMIPP_P0CPPCR_LSM_B_0X0			(0x0u<<10)
#define	DCMIPP_P0CPPCR_LSM_B_0X1			(0x1u<<10)
#define	DCMIPP_P0CPPCR_OEBS_B_0X0			(0x0u<<9)
#define	DCMIPP_P0CPPCR_OEBS_B_0X1			(0x1u<<9)
#define	DCMIPP_P0CPPCR_BSM_B_0X0			(0x0u<<7)
#define	DCMIPP_P0CPPCR_BSM_B_0X1			(0x1u<<7)
#define	DCMIPP_P0CPPCR_BSM_B_0X2			(0x2u<<7)
#define	DCMIPP_P0CPPCR_BSM_B_0X3			(0x3u<<7)
#define	DCMIPP_P0CPPCR_HEADEREN_B_0X0		(0x0u<<6)
#define	DCMIPP_P0CPPCR_HEADEREN_B_0X1		(0x1u<<6)
#define	DCMIPP_P0CPPCR_PAD_B_0X0			(0x0u<<5)
#define	DCMIPP_P0CPPCR_PAD_B_0X1			(0x1u<<5)
#define	DCMIPP_P0CPPCR_SWAPYUV_B_0X0		(0x0u<<0)
#define	DCMIPP_P0CPPCR_SWAPYUV_B_0X1		(0x1u<<0)

// P0CPPM0AR1 Configuration

#define	DCMIPP_P0CPPM0AR1_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P0CPPM0AR1_M0A_0				(0x1u<<0)

// P0CPPM0AR2 Configuration

#define	DCMIPP_P0CPPM0AR2_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P0CPPM0AR2_M0A_0				(0x1u<<0)

// P1FSCR Configuration

#define	DCMIPP_P1FSCR_PIPEN					(0x1u<<31)
#define	DCMIPP_P1FSCR_FDTFEN				(0x1u<<30)
#define	DCMIPP_P1FSCR_FDTF					(0x3Fu<<24)
#define	DCMIPP_P1FSCR_FDTF_0				(0x1u<<24)
#define	DCMIPP_P1FSCR_VC					(0x3u<<19)
#define	DCMIPP_P1FSCR_VC_0					(0x1u<<19)
#define	DCMIPP_P1FSCR_PIPEDIFF				(0x1u<<18)
#define	DCMIPP_P1FSCR_DTMODE				(0x3u<<16)
#define	DCMIPP_P1FSCR_DTMODE_0				(0x1u<<16)
#define	DCMIPP_P1FSCR_DTIDB					(0x3Fu<<8)
#define	DCMIPP_P1FSCR_DTIDB_0				(0x1u<<8)
#define	DCMIPP_P1FSCR_DTIDA					(0x3Fu<<0)
#define	DCMIPP_P1FSCR_DTIDA_0				(0x1u<<0)

#define	DCMIPP_P1FSCR_PIPEN_B_0X0			(0x0u<<31)
#define	DCMIPP_P1FSCR_PIPEN_B_0X1			(0x1u<<31)
#define	DCMIPP_P1FSCR_FDTFEN_B_0X0			(0x0u<<30)
#define	DCMIPP_P1FSCR_PIPEDIFF_B_0X0		(0x0u<<18)
#define	DCMIPP_P1FSCR_PIPEDIFF_B_0X1		(0x1u<<18)
#define	DCMIPP_P1FSCR_DTMODE_B_0X0			(0x0u<<16)
#define	DCMIPP_P1FSCR_DTMODE_B_0X1			(0x1u<<16)

// P1SRCR Configuration

#define	DCMIPP_P1SRCR_CROPEN				(0x1u<<15)
#define	DCMIPP_P1SRCR_FIRSTLINEDEL			(0x7u<<12)
#define	DCMIPP_P1SRCR_FIRSTLINEDEL_0		(0x1u<<12)
#define	DCMIPP_P1SRCR_LASTLINE				(0xFFFu<<0)
#define	DCMIPP_P1SRCR_LASTLINE_0			(0x1u<<0)

#define	DCMIPP_P1SRCR_CROPEN_B_0X0			(0x0u<<15)
#define	DCMIPP_P1SRCR_CROPEN_B_0X1			(0x1u<<15)

// P1BPRCR Configuration

#define	DCMIPP_P1BPRCR_STRENGTH				(0x7u<<1)
#define	DCMIPP_P1BPRCR_STRENGTH_0			(0x1u<<1)
#define	DCMIPP_P1BPRCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1BPRCR_STRENGTH_B_0X0		(0x0u<<1)
#define	DCMIPP_P1BPRCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1BPRCR_ENABLE_B_0X1			(0x1u<<0)

// P1BPRSR Configuration

