hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_P1BPRSR_BADCNT				(0xFFFu<<0)
#define	DCMIPP_P1BPRSR_BADCNT_0				(0x1u<<0)

// P1DECR Configuration

#define	DCMIPP_P1DECR_VDEC					(0x3u<<3)
#define	DCMIPP_P1DECR_VDEC_0				(0x1u<<3)
#define	DCMIPP_P1DECR_HDEC					(0x3u<<1)
#define	DCMIPP_P1DECR_HDEC_0				(0x1u<<1)
#define	DCMIPP_P1DECR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1DECR_VDEC_B_0X0			(0x0u<<3)
#define	DCMIPP_P1DECR_VDEC_B_0X1			(0x1u<<3)
#define	DCMIPP_P1DECR_HDEC_B_0X0			(0x0u<<1)
#define	DCMIPP_P1DECR_HDEC_B_0X1			(0x1u<<1)
#define	DCMIPP_P1DECR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1DECR_ENABLE_B_0X1			(0x1u<<0)

// P1BLCCR Configuration

#define	DCMIPP_P1BLCCR_BLCR					(0xFFu<<24)
#define	DCMIPP_P1BLCCR_BLCR_0				(0x1u<<24)
#define	DCMIPP_P1BLCCR_BLCG					(0xFFu<<16)
#define	DCMIPP_P1BLCCR_BLCG_0				(0x1u<<16)
#define	DCMIPP_P1BLCCR_BLCB					(0xFFu<<8)
#define	DCMIPP_P1BLCCR_BLCB_0				(0x1u<<8)
#define	DCMIPP_P1BLCCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1BLCCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1BLCCR_ENABLE_B_0X1			(0x1u<<0)

// P1EXCR1 Configuration

#define	DCMIPP_P1EXCR1_SHFR					(0x7u<<28)
#define	DCMIPP_P1EXCR1_SHFR_0				(0x1u<<28)
#define	DCMIPP_P1EXCR1_MULTR				(0xFFu<<20)
#define	DCMIPP_P1EXCR1_MULTR_0				(0x1u<<20)
#define	DCMIPP_P1EXCR1_ENABLE				(0x1u<<0)

#define	DCMIPP_P1EXCR1_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1EXCR1_ENABLE_B_0X1			(0x1u<<0)

// P1EXCR2 Configuration

#define	DCMIPP_P1EXCR2_SHFG					(0x7u<<28)
#define	DCMIPP_P1EXCR2_SHFG_0				(0x1u<<28)
#define	DCMIPP_P1EXCR2_MULTG				(0xFFu<<20)
#define	DCMIPP_P1EXCR2_MULTG_0				(0x1u<<20)
#define	DCMIPP_P1EXCR2_SHFB					(0x7u<<12)
#define	DCMIPP_P1EXCR2_SHFB_0				(0x1u<<12)
#define	DCMIPP_P1EXCR2_MULTB				(0xFFu<<4)
#define	DCMIPP_P1EXCR2_MULTB_0				(0x1u<<4)

// P1ST1CR Configuration

#define	DCMIPP_P1ST1CR_MODE					(0x1u<<7)
#define	DCMIPP_P1ST1CR_SRC					(0x7u<<4)
#define	DCMIPP_P1ST1CR_SRC_0				(0x1u<<4)
#define	DCMIPP_P1ST1CR_BINS					(0x3u<<2)
#define	DCMIPP_P1ST1CR_BINS_0				(0x1u<<2)
#define	DCMIPP_P1ST1CR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1ST1CR_MODE_B_0X0			(0x0u<<7)
#define	DCMIPP_P1ST1CR_MODE_B_0X1			(0x1u<<7)
#define	DCMIPP_P1ST1CR_BINS_B_0X0			(0x0u<<2)
#define	DCMIPP_P1ST1CR_BINS_B_0X1			(0x1u<<2)
#define	DCMIPP_P1ST1CR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1ST1CR_ENABLE_B_0X1			(0x1u<<0)

// P1ST2CR Configuration

#define	DCMIPP_P1ST2CR_MODE					(0x1u<<7)
#define	DCMIPP_P1ST2CR_SRC					(0x7u<<4)
#define	DCMIPP_P1ST2CR_SRC_0				(0x1u<<4)
#define	DCMIPP_P1ST2CR_BINS					(0x3u<<2)
#define	DCMIPP_P1ST2CR_BINS_0				(0x1u<<2)
#define	DCMIPP_P1ST2CR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1ST2CR_MODE_B_0X0			(0x0u<<7)
#define	DCMIPP_P1ST2CR_MODE_B_0X1			(0x1u<<7)
#define	DCMIPP_P1ST2CR_BINS_B_0X0			(0x0u<<2)
#define	DCMIPP_P1ST2CR_BINS_B_0X1			(0x1u<<2)
#define	DCMIPP_P1ST2CR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1ST2CR_ENABLE_B_0X1			(0x1u<<0)

// P1ST3CR Configuration

#define	DCMIPP_P1ST3CR_MODE					(0x1u<<7)
#define	DCMIPP_P1ST3CR_SRC					(0x7u<<4)
#define	DCMIPP_P1ST3CR_SRC_0				(0x1u<<4)
#define	DCMIPP_P1ST3CR_BINS					(0x3u<<2)
#define	DCMIPP_P1ST3CR_BINS_0				(0x1u<<2)
#define	DCMIPP_P1ST3CR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1ST3CR_MODE_B_0X0			(0x0u<<7)
#define	DCMIPP_P1ST3CR_MODE_B_0X1			(0x1u<<7)
#define	DCMIPP_P1ST3CR_BINS_B_0X0			(0x0u<<2)
#define	DCMIPP_P1ST3CR_BINS_B_0X1			(0x1u<<2)
#define	DCMIPP_P1ST3CR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1ST3CR_ENABLE_B_0X1			(0x1u<<0)

// P1STSTR Configuration

#define	DCMIPP_P1STSTR_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1STSTR_VSTART_0				(0x1u<<16)
#define	DCMIPP_P1STSTR_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1STSTR_HSTART_0				(0x1u<<0)

// P1STSZR Configuration

#define	DCMIPP_P1STSZR_CROPEN				(0x1u<<31)
#define	DCMIPP_P1STSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1STSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1STSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1STSZR_HSIZE_0				(0x1u<<0)

#define	DCMIPP_P1STSZR_CROPEN_B_0X0			(0x0u<<31)
#define	DCMIPP_P1STSZR_CROPEN_B_0X1			(0x1u<<31)

// P1ST1SR Configuration

#define	DCMIPP_P1ST1SR_ACCU					(0xFFFFFFu<<0)
#define	DCMIPP_P1ST1SR_ACCU_0				(0x1u<<0)

// P1ST2SR Configuration

#define	DCMIPP_P1ST2SR_ACCU					(0xFFFFFFu<<0)
#define	DCMIPP_P1ST2SR_ACCU_0				(0x1u<<0)

// P1ST3SR Configuration

#define	DCMIPP_P1ST3SR_ACCU					(0xFFFFFFu<<0)
#define	DCMIPP_P1ST3SR_ACCU_0				(0x1u<<0)

// P1DMCR Configuration

#define	DCMIPP_P1DMCR_EDGE					(0x7u<<28)
#define	DCMIPP_P1DMCR_EDGE_0				(0x1u<<28)
#define	DCMIPP_P1DMCR_LINEH					(0x7u<<24)
#define	DCMIPP_P1DMCR_LINEH_0				(0x1u<<24)
#define	DCMIPP_P1DMCR_LINEV					(0x7u<<20)
#define	DCMIPP_P1DMCR_LINEV_0				(0x1u<<20)
#define	DCMIPP_P1DMCR_PEAK					(0x7u<<16)
#define	DCMIPP_P1DMCR_PEAK_0				(0x1u<<16)
#define	DCMIPP_P1DMCR_TYPE					(0x3u<<1)
#define	DCMIPP_P1DMCR_TYPE_0				(0x1u<<1)
#define	DCMIPP_P1DMCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1DMCR_EDGE_B_0X0			(0x0u<<28)
#define	DCMIPP_P1DMCR_LINEH_B_0X0			(0x0u<<24)
#define	DCMIPP_P1DMCR_LINEV_B_0X0			(0x0u<<20)
#define	DCMIPP_P1DMCR_PEAK_B_0X0			(0x0u<<16)
#define	DCMIPP_P1DMCR_TYPE_B_0X0			(0x0u<<1)
#define	DCMIPP_P1DMCR_TYPE_B_0X1			(0x1u<<1)
#define	DCMIPP_P1DMCR_TYPE_B_0X2			(0x2u<<1)
#define	DCMIPP_P1DMCR_TYPE_B_0X3			(0x3u<<1)
#define	DCMIPP_P1DMCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1DMCR_ENABLE_B_0X1			(0x1u<<0)

// P1CCCR Configuration

#define	DCMIPP_P1CCCR_CLAMP					(0x1u<<2)
#define	DCMIPP_P1CCCR_TYPE					(0x1u<<1)
#define	DCMIPP_P1CCCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CCCR_CLAMP_B_0X0			(0x0u<<2)
#define	DCMIPP_P1CCCR_CLAMP_B_0X1			(0x1u<<2)
#define	DCMIPP_P1CCCR_TYPE_B_0X0			(0x0u<<1)
#define	DCMIPP_P1CCCR_TYPE_B_0X1			(0x1u<<1)
#define	DCMIPP_P1CCCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1CCCR_ENABLE_B_0X1			(0x1u<<0)

// P1CCRR1 Configuration

#define	DCMIPP_P1CCRR1_RG					(0x7FFu<<16)
#define	DCMIPP_P1CCRR1_RG_0					(0x1u<<16)
#define	DCMIPP_P1CCRR1_RR					(0x7FFu<<0)
#define	DCMIPP_P1CCRR1_RR_0					(0x1u<<0)

// P1CCRR2 Configuration

#define	DCMIPP_P1CCRR2_RA					(0x3FFu<<16)
#define	DCMIPP_P1CCRR2_RA_0					(0x1u<<16)
#define	DCMIPP_P1CCRR2_RB					(0x7FFu<<0)
#define	DCMIPP_P1CCRR2_RB_0					(0x1u<<0)

// P1CCGR1 Configuration

