hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_P1CCGR1_GG					(0x7FFu<<16)
#define	DCMIPP_P1CCGR1_GG_0					(0x1u<<16)
#define	DCMIPP_P1CCGR1_GR					(0x7FFu<<0)
#define	DCMIPP_P1CCGR1_GR_0					(0x1u<<0)

// P1CCGR2 Configuration

#define	DCMIPP_P1CCGR2_GA					(0x3FFu<<16)
#define	DCMIPP_P1CCGR2_GA_0					(0x1u<<16)
#define	DCMIPP_P1CCGR2_GB					(0x7FFu<<0)
#define	DCMIPP_P1CCGR2_GB_0					(0x1u<<0)

// P1CCBR1 Configuration

#define	DCMIPP_P1CCBR1_BG					(0x7FFu<<16)
#define	DCMIPP_P1CCBR1_BG_0					(0x1u<<16)
#define	DCMIPP_P1CCBR1_BR					(0x7FFu<<0)
#define	DCMIPP_P1CCBR1_BR_0					(0x1u<<0)

// P1CCBR2 Configuration

#define	DCMIPP_P1CCBR2_BA					(0x3FFu<<16)
#define	DCMIPP_P1CCBR2_BA_0					(0x1u<<16)
#define	DCMIPP_P1CCBR2_BB					(0x7FFu<<0)
#define	DCMIPP_P1CCBR2_BB_0					(0x1u<<0)

// P1CTCR1 Configuration

#define	DCMIPP_P1CTCR1_LUM0					(0x3Fu<<9)
#define	DCMIPP_P1CTCR1_LUM0_0				(0x1u<<9)
#define	DCMIPP_P1CTCR1_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CTCR1_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1CTCR1_ENABLE_B_0X1			(0x1u<<0)

// P1CTCR2 Configuration

#define	DCMIPP_P1CTCR2_LUM1					(0x3Fu<<25)
#define	DCMIPP_P1CTCR2_LUM1_0				(0x1u<<25)
#define	DCMIPP_P1CTCR2_LUM2					(0x3Fu<<17)
#define	DCMIPP_P1CTCR2_LUM2_0				(0x1u<<17)
#define	DCMIPP_P1CTCR2_LUM3					(0x3Fu<<9)
#define	DCMIPP_P1CTCR2_LUM3_0				(0x1u<<9)
#define	DCMIPP_P1CTCR2_LUM4					(0x3Fu<<1)
#define	DCMIPP_P1CTCR2_LUM4_0				(0x1u<<1)

// P1CTCR3 Configuration

#define	DCMIPP_P1CTCR3_LUM5					(0x3Fu<<25)
#define	DCMIPP_P1CTCR3_LUM5_0				(0x1u<<25)
#define	DCMIPP_P1CTCR3_LUM6					(0x3Fu<<17)
#define	DCMIPP_P1CTCR3_LUM6_0				(0x1u<<17)
#define	DCMIPP_P1CTCR3_LUM7					(0x3Fu<<9)
#define	DCMIPP_P1CTCR3_LUM7_0				(0x1u<<9)
#define	DCMIPP_P1CTCR3_LUM8					(0x3Fu<<1)
#define	DCMIPP_P1CTCR3_LUM8_0				(0x1u<<1)

// P1FCTCR Configuration

#define	DCMIPP_P1FCTCR_CPTREQ				(0x1u<<3)
#define	DCMIPP_P1FCTCR_CPTMODE				(0x1u<<2)
#define	DCMIPP_P1FCTCR_FRATE				(0x3u<<0)
#define	DCMIPP_P1FCTCR_FRATE_0				(0x1u<<0)

#define	DCMIPP_P1FCTCR_CPTREQ_B_0X0			(0x0u<<3)
#define	DCMIPP_P1FCTCR_CPTREQ_B_0X1			(0x1u<<3)
#define	DCMIPP_P1FCTCR_CPTMODE_B_0X0		(0x0u<<2)
#define	DCMIPP_P1FCTCR_CPTMODE_B_0X1		(0x1u<<2)
#define	DCMIPP_P1FCTCR_FRATE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1FCTCR_FRATE_B_0X1			(0x1u<<0)
#define	DCMIPP_P1FCTCR_FRATE_B_0X2			(0x2u<<0)
#define	DCMIPP_P1FCTCR_FRATE_B_0X3			(0x3u<<0)

// P1CRSTR Configuration

#define	DCMIPP_P1CRSTR_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1CRSTR_VSTART_0				(0x1u<<16)
#define	DCMIPP_P1CRSTR_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1CRSTR_HSTART_0				(0x1u<<0)

// P1CRSZR Configuration

#define	DCMIPP_P1CRSZR_ENABLE				(0x1u<<31)
#define	DCMIPP_P1CRSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1CRSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1CRSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1CRSZR_HSIZE_0				(0x1u<<0)

#define	DCMIPP_P1CRSZR_ENABLE_B_0X0			(0x0u<<31)
#define	DCMIPP_P1CRSZR_ENABLE_B_0X1			(0x1u<<31)

// P1DCCR Configuration

#define	DCMIPP_P1DCCR_VDEC					(0x3u<<3)
#define	DCMIPP_P1DCCR_VDEC_0				(0x1u<<3)
#define	DCMIPP_P1DCCR_HDEC					(0x3u<<1)
#define	DCMIPP_P1DCCR_HDEC_0				(0x1u<<1)
#define	DCMIPP_P1DCCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1DCCR_VDEC_B_0X0			(0x0u<<3)
#define	DCMIPP_P1DCCR_VDEC_B_0X1			(0x1u<<3)
#define	DCMIPP_P1DCCR_HDEC_B_0X0			(0x0u<<1)
#define	DCMIPP_P1DCCR_HDEC_B_0X1			(0x1u<<1)
#define	DCMIPP_P1DCCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1DCCR_ENABLE_B_0X1			(0x1u<<0)

// P1DSCR Configuration

#define	DCMIPP_P1DSCR_ENABLE				(0x1u<<31)
#define	DCMIPP_P1DSCR_VDIV					(0x3FFu<<16)
#define	DCMIPP_P1DSCR_VDIV_0				(0x1u<<16)
#define	DCMIPP_P1DSCR_HDIV					(0x3FFu<<0)
#define	DCMIPP_P1DSCR_HDIV_0				(0x1u<<0)

#define	DCMIPP_P1DSCR_ENABLE_B_0X0			(0x0u<<31)
#define	DCMIPP_P1DSCR_ENABLE_B_0X1			(0x1u<<31)

// P1DSRTIOR Configuration

#define	DCMIPP_P1DSRTIOR_VRATIO				(0xFFFFu<<16)
#define	DCMIPP_P1DSRTIOR_VRATIO_0			(0x1u<<16)
#define	DCMIPP_P1DSRTIOR_HRATIO				(0xFFFFu<<0)
#define	DCMIPP_P1DSRTIOR_HRATIO_0			(0x1u<<0)

// P1DSSZR Configuration

#define	DCMIPP_P1DSSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1DSSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1DSSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1DSSZR_HSIZE_0				(0x1u<<0)

// P1CMRICR Configuration

#define	DCMIPP_P1CMRICR_ROI8EN				(0x1u<<23)
#define	DCMIPP_P1CMRICR_ROI7EN				(0x1u<<22)
#define	DCMIPP_P1CMRICR_ROI6EN				(0x1u<<21)
#define	DCMIPP_P1CMRICR_ROI5EN				(0x1u<<20)
#define	DCMIPP_P1CMRICR_ROI4EN				(0x1u<<19)
#define	DCMIPP_P1CMRICR_ROI3EN				(0x1u<<18)
#define	DCMIPP_P1CMRICR_ROI2EN				(0x1u<<17)
#define	DCMIPP_P1CMRICR_ROI1EN				(0x1u<<16)
#define	DCMIPP_P1CMRICR_ROILSZ				(0x3u<<0)
#define	DCMIPP_P1CMRICR_ROILSZ_0			(0x1u<<0)

#define	DCMIPP_P1CMRICR_ROI8EN_B_0X0		(0x0u<<23)
#define	DCMIPP_P1CMRICR_ROI8EN_B_0X1		(0x1u<<23)
#define	DCMIPP_P1CMRICR_ROI7EN_B_0X0		(0x0u<<22)
#define	DCMIPP_P1CMRICR_ROI7EN_B_0X1		(0x1u<<22)
#define	DCMIPP_P1CMRICR_ROI6EN_B_0X0		(0x0u<<21)
#define	DCMIPP_P1CMRICR_ROI6EN_B_0X1		(0x1u<<21)
#define	DCMIPP_P1CMRICR_ROI5EN_B_0X0		(0x0u<<20)
#define	DCMIPP_P1CMRICR_ROI5EN_B_0X1		(0x1u<<20)
#define	DCMIPP_P1CMRICR_ROI4EN_B_0X0		(0x0u<<19)
#define	DCMIPP_P1CMRICR_ROI4EN_B_0X1		(0x1u<<19)
#define	DCMIPP_P1CMRICR_ROI3EN_B_0X0		(0x0u<<18)
#define	DCMIPP_P1CMRICR_ROI3EN_B_0X1		(0x1u<<18)
#define	DCMIPP_P1CMRICR_ROI2EN_B_0X0		(0x0u<<17)
#define	DCMIPP_P1CMRICR_ROI2EN_B_0X1		(0x1u<<17)
#define	DCMIPP_P1CMRICR_ROI1EN_B_0X0		(0x0u<<16)
#define	DCMIPP_P1CMRICR_ROI1EN_B_0X1		(0x1u<<16)
#define	DCMIPP_P1CMRICR_ROILSZ_B_0X0		(0x0u<<0)
#define	DCMIPP_P1CMRICR_ROILSZ_B_0X1		(0x1u<<0)
#define	DCMIPP_P1CMRICR_ROILSZ_B_0X2		(0x2u<<0)
#define	DCMIPP_P1CMRICR_ROILSZ_B_0X3		(0x3u<<0)

// P1RI1CR1 Configuration

#define	DCMIPP_P1RI1CR1_CLR					(0x3u<<28)
#define	DCMIPP_P1RI1CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1RI1CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1RI1CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1RI1CR1_CLG					(0x3u<<14)
#define	DCMIPP_P1RI1CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1RI1CR1_CLB					(0x3u<<12)
#define	DCMIPP_P1RI1CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1RI1CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1RI1CR1_HSTART_0			(0x1u<<0)

// P1RI1CR2 Configuration

#define	DCMIPP_P1RI1CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1RI1CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1RI1CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1RI1CR2_HSIZE_0				(0x1u<<0)

