hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
// P1RI2CR1 Configuration

#define	DCMIPP_P1RI2CR1_CLR					(0x3u<<28)
#define	DCMIPP_P1RI2CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1RI2CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1RI2CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1RI2CR1_CLG					(0x3u<<14)
#define	DCMIPP_P1RI2CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1RI2CR1_CLB					(0x3u<<12)
#define	DCMIPP_P1RI2CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1RI2CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1RI2CR1_HSTART_0			(0x1u<<0)

// P1RI2CR2 Configuration

#define	DCMIPP_P1RI2CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1RI2CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1RI2CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1RI2CR2_HSIZE_0				(0x1u<<0)

// P1RI3CR1 Configuration

#define	DCMIPP_P1RI3CR1_CLR					(0x3u<<28)
#define	DCMIPP_P1RI3CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1RI3CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1RI3CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1RI3CR1_CLG					(0x3u<<14)
#define	DCMIPP_P1RI3CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1RI3CR1_CLB					(0x3u<<12)
#define	DCMIPP_P1RI3CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1RI3CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1RI3CR1_HSTART_0			(0x1u<<0)

// P1RI3CR2 Configuration

#define	DCMIPP_P1RI3CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1RI3CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1RI3CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1RI3CR2_HSIZE_0				(0x1u<<0)

// P1RI4CR1 Configuration

#define	DCMIPP_P1RI4CR1_CLR					(0x3u<<28)
#define	DCMIPP_P1RI4CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1RI4CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1RI4CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1RI4CR1_CLG					(0x3u<<14)
#define	DCMIPP_P1RI4CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1RI4CR1_CLB					(0x3u<<12)
#define	DCMIPP_P1RI4CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1RI4CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1RI4CR1_HSTART_0			(0x1u<<0)

// P1RI4CR2 Configuration

#define	DCMIPP_P1RI4CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1RI4CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1RI4CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1RI4CR2_HSIZE_0				(0x1u<<0)

// P1RI5CR1 Configuration

#define	DCMIPP_P1RI5CR1_CLR					(0x3u<<28)
#define	DCMIPP_P1RI5CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1RI5CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1RI5CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1RI5CR1_CLG					(0x3u<<14)
#define	DCMIPP_P1RI5CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1RI5CR1_CLB					(0x3u<<12)
#define	DCMIPP_P1RI5CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1RI5CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1RI5CR1_HSTART_0			(0x1u<<0)

// P1RI5CR2 Configuration

#define	DCMIPP_P1RI5CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1RI5CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1RI5CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1RI5CR2_HSIZE_0				(0x1u<<0)

// P1RI6CR1 Configuration

#define	DCMIPP_P1RI6CR1_CLR					(0x3u<<28)
#define	DCMIPP_P1RI6CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1RI6CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1RI6CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1RI6CR1_CLG					(0x3u<<14)
#define	DCMIPP_P1RI6CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1RI6CR1_CLB					(0x3u<<12)
#define	DCMIPP_P1RI6CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1RI6CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1RI6CR1_HSTART_0			(0x1u<<0)

// P1RI6CR2 Configuration

#define	DCMIPP_P1RI6CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1RI6CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1RI6CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1RI6CR2_HSIZE_0				(0x1u<<0)

// P1RI7CR1 Configuration

#define	DCMIPP_P1RI7CR1_CLR					(0x3u<<28)
#define	DCMIPP_P1RI7CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1RI7CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1RI7CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1RI7CR1_CLG					(0x3u<<14)
#define	DCMIPP_P1RI7CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1RI7CR1_CLB					(0x3u<<12)
#define	DCMIPP_P1RI7CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1RI7CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1RI7CR1_HSTART_0			(0x1u<<0)

// P1RI7CR2 Configuration

#define	DCMIPP_P1RI7CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1RI7CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1RI7CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1RI7CR2_HSIZE_0				(0x1u<<0)

// P1RI8CR1 Configuration

#define	DCMIPP_P1RI8CR1_CLR					(0x3u<<28)
#define	DCMIPP_P1RI8CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1RI8CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1RI8CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1RI8CR1_CLG					(0x3u<<14)
#define	DCMIPP_P1RI8CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1RI8CR1_CLB					(0x3u<<12)
#define	DCMIPP_P1RI8CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1RI8CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1RI8CR1_HSTART_0			(0x1u<<0)

// P1RI8CR2 Configuration

#define	DCMIPP_P1RI8CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1RI8CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1RI8CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1RI8CR2_HSIZE_0				(0x1u<<0)

// P1GMCR Configuration

#define	DCMIPP_P1GMCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1GMCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1GMCR_ENABLE_B_0X1			(0x1u<<0)

// P1YUVCR Configuration

#define	DCMIPP_P1YUVCR_CLAMP				(0x1u<<2)
#define	DCMIPP_P1YUVCR_TYPE					(0x1u<<1)
#define	DCMIPP_P1YUVCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1YUVCR_CLAMP_B_0X0			(0x0u<<2)
#define	DCMIPP_P1YUVCR_CLAMP_B_0X1			(0x1u<<2)
#define	DCMIPP_P1YUVCR_TYPE_B_0X0			(0x0u<<1)
#define	DCMIPP_P1YUVCR_TYPE_B_0X1			(0x1u<<1)
#define	DCMIPP_P1YUVCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1YUVCR_ENABLE_B_0X1			(0x1u<<0)

// P1YUVRR1 Configuration

#define	DCMIPP_P1YUVRR1_RG					(0x7FFu<<16)
#define	DCMIPP_P1YUVRR1_RG_0				(0x1u<<16)
#define	DCMIPP_P1YUVRR1_RR					(0x7FFu<<0)
#define	DCMIPP_P1YUVRR1_RR_0				(0x1u<<0)

// P1YUVRR2 Configuration

#define	DCMIPP_P1YUVRR2_RA					(0x3FFu<<16)
#define	DCMIPP_P1YUVRR2_RA_0				(0x1u<<16)
#define	DCMIPP_P1YUVRR2_RB					(0x7FFu<<0)
#define	DCMIPP_P1YUVRR2_RB_0				(0x1u<<0)

// P1YUVGR1 Configuration

#define	DCMIPP_P1YUVGR1_GG					(0x7FFu<<16)
#define	DCMIPP_P1YUVGR1_GG_0				(0x1u<<16)
#define	DCMIPP_P1YUVGR1_GR					(0x7FFu<<0)
#define	DCMIPP_P1YUVGR1_GR_0				(0x1u<<0)

// P1YUVGR2 Configuration

#define	DCMIPP_P1YUVGR2_GA					(0x3FFu<<16)
#define	DCMIPP_P1YUVGR2_GA_0				(0x1u<<16)
#define	DCMIPP_P1YUVGR2_GB					(0x7FFu<<0)
#define	DCMIPP_P1YUVGR2_GB_0				(0x1u<<0)

