hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
// P1YUVBR1 Configuration

#define	DCMIPP_P1YUVBR1_BG					(0x7FFu<<16)
#define	DCMIPP_P1YUVBR1_BG_0				(0x1u<<16)
#define	DCMIPP_P1YUVBR1_BR					(0x7FFu<<0)
#define	DCMIPP_P1YUVBR1_BR_0				(0x1u<<0)

// P1YUVBR2 Configuration

#define	DCMIPP_P1YUVBR2_BA					(0x3FFu<<16)
#define	DCMIPP_P1YUVBR2_BA_0				(0x1u<<16)
#define	DCMIPP_P1YUVBR2_BB					(0x7FFu<<0)
#define	DCMIPP_P1YUVBR2_BB_0				(0x1u<<0)

// P1PPCR Configuration

#define	DCMIPP_P1PPCR_LMAWE					(0x1u<<20)
#define	DCMIPP_P1PPCR_LMAWM					(0x7u<<17)
#define	DCMIPP_P1PPCR_LMAWM_0				(0x1u<<17)
#define	DCMIPP_P1PPCR_DBM					(0x1u<<16)
#define	DCMIPP_P1PPCR_LINEMULT				(0x7u<<13)
#define	DCMIPP_P1PPCR_LINEMULT_0			(0x1u<<13)
#define	DCMIPP_P1PPCR_SWAPRB				(0x1u<<4)
#define	DCMIPP_P1PPCR_FORMAT				(0xFu<<0)
#define	DCMIPP_P1PPCR_FORMAT_0				(0x1u<<0)

#define	DCMIPP_P1PPCR_LMAWE_B_0X0			(0x0u<<20)
#define	DCMIPP_P1PPCR_LMAWE_B_0X1			(0x1u<<20)
#define	DCMIPP_P1PPCR_LMAWM_B_0X0			(0x0u<<17)
#define	DCMIPP_P1PPCR_LMAWM_B_0X1			(0x1u<<17)
#define	DCMIPP_P1PPCR_LMAWM_B_0X2			(0x2u<<17)
#define	DCMIPP_P1PPCR_LMAWM_B_0X3			(0x3u<<17)
#define	DCMIPP_P1PPCR_LMAWM_B_0X4			(0x4u<<17)
#define	DCMIPP_P1PPCR_LMAWM_B_0X5			(0x5u<<17)
#define	DCMIPP_P1PPCR_LMAWM_B_0X6			(0x6u<<17)
#define	DCMIPP_P1PPCR_LMAWM_B_0X7			(0x7u<<17)
#define	DCMIPP_P1PPCR_DBM_B_0X0				(0x0u<<16)
#define	DCMIPP_P1PPCR_DBM_B_0X1				(0x1u<<16)
#define	DCMIPP_P1PPCR_LINEMULT_B_0X0		(0x0u<<13)
#define	DCMIPP_P1PPCR_LINEMULT_B_0X1		(0x1u<<13)
#define	DCMIPP_P1PPCR_LINEMULT_B_0X2		(0x2u<<13)
#define	DCMIPP_P1PPCR_LINEMULT_B_0X3		(0x3u<<13)
#define	DCMIPP_P1PPCR_LINEMULT_B_0X4		(0x4u<<13)
#define	DCMIPP_P1PPCR_LINEMULT_B_0X5		(0x5u<<13)
#define	DCMIPP_P1PPCR_LINEMULT_B_0X6		(0x6u<<13)
#define	DCMIPP_P1PPCR_LINEMULT_B_0X7		(0x7u<<13)
#define	DCMIPP_P1PPCR_SWAPRB_B_0X0			(0x0u<<4)
#define	DCMIPP_P1PPCR_SWAPRB_B_0X1			(0x1u<<4)
#define	DCMIPP_P1PPCR_FORMAT_B_0X0			(0x0u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0X1			(0x1u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0X2			(0x2u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0X3			(0x3u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0X4			(0x4u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0X5			(0x5u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0X6			(0x6u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0X7			(0x7u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0X8			(0x8u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0X9			(0x9u<<0)
#define	DCMIPP_P1PPCR_FORMAT_B_0XA			(0xAu<<0)

// P1PPM0AR1 Configuration

#define	DCMIPP_P1PPM0AR1_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1PPM0AR1_M0A_0				(0x1u<<0)

// P1PPM0AR2 Configuration

#define	DCMIPP_P1PPM0AR2_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1PPM0AR2_M0A_0				(0x1u<<0)

// P1PPM0PR Configuration

#define	DCMIPP_P1PPM0PR_PITCH				(0x7FFFu<<0)
#define	DCMIPP_P1PPM0PR_PITCH_0				(0x1u<<0)

// P1STM0AR Configuration

#define	DCMIPP_P1STM0AR_M0A					(0xFFFFFFFFu<<0)
#define	DCMIPP_P1STM0AR_M0A_0				(0x1u<<0)

// P1PPM1AR1 Configuration

#define	DCMIPP_P1PPM1AR1_M1A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1PPM1AR1_M1A_0				(0x1u<<0)

// P1PPM1AR2 Configuration

#define	DCMIPP_P1PPM1AR2_M1A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1PPM1AR2_M1A_0				(0x1u<<0)

// P1PPM1PR Configuration

#define	DCMIPP_P1PPM1PR_PITCH				(0x7FFFu<<0)
#define	DCMIPP_P1PPM1PR_PITCH_0				(0x1u<<0)

// P1STM1AR Configuration

#define	DCMIPP_P1STM1AR_M1A					(0xFFFFFFFFu<<0)
#define	DCMIPP_P1STM1AR_M1A_0				(0x1u<<0)

// P1PPM2AR1 Configuration

#define	DCMIPP_P1PPM2AR1_M2A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1PPM2AR1_M2A_0				(0x1u<<0)

// P1PPM2AR2 Configuration

#define	DCMIPP_P1PPM2AR2_M2A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1PPM2AR2_M2A_0				(0x1u<<0)

// P1STM2AR Configuration

#define	DCMIPP_P1STM2AR_M2A					(0xFFFFFFFFu<<0)
#define	DCMIPP_P1STM2AR_M2A_0				(0x1u<<0)

// P1IER Configuration

#define	DCMIPP_P1IER_OVRIE					(0x1u<<7)
#define	DCMIPP_P1IER_VSYNCIE				(0x1u<<2)
#define	DCMIPP_P1IER_FRAMEIE				(0x1u<<1)
#define	DCMIPP_P1IER_LINEIE					(0x1u<<0)

#define	DCMIPP_P1IER_OVRIE_B_0X0			(0x0u<<7)
#define	DCMIPP_P1IER_OVRIE_B_0X1			(0x1u<<7)
#define	DCMIPP_P1IER_VSYNCIE_B_0X0			(0x0u<<2)
#define	DCMIPP_P1IER_VSYNCIE_B_0X1			(0x1u<<2)
#define	DCMIPP_P1IER_FRAMEIE_B_0X0			(0x0u<<1)
#define	DCMIPP_P1IER_FRAMEIE_B_0X1			(0x1u<<1)
#define	DCMIPP_P1IER_LINEIE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1IER_LINEIE_B_0X1			(0x1u<<0)

// P1SR Configuration

#define	DCMIPP_P1SR_CPTACT					(0x1u<<23)
#define	DCMIPP_P1SR_LSTFRM					(0x1u<<17)
#define	DCMIPP_P1SR_LSTLINE					(0x1u<<16)
#define	DCMIPP_P1SR_OVRF					(0x1u<<7)
#define	DCMIPP_P1SR_VSYNCF					(0x1u<<2)
#define	DCMIPP_P1SR_FRAMEF					(0x1u<<1)
#define	DCMIPP_P1SR_LINEF					(0x1u<<0)

#define	DCMIPP_P1SR_CPTACT_B_0X0			(0x0u<<23)
#define	DCMIPP_P1SR_CPTACT_B_0X1			(0x1u<<23)
#define	DCMIPP_P1SR_OVRF_B_0X0				(0x0u<<7)
#define	DCMIPP_P1SR_OVRF_B_0X1				(0x1u<<7)
#define	DCMIPP_P1SR_FRAMEF_B_0X0			(0x0u<<1)
#define	DCMIPP_P1SR_FRAMEF_B_0X1			(0x1u<<1)

// P1FCR Configuration

#define	DCMIPP_P1FCR_COVRF					(0x1u<<7)
#define	DCMIPP_P1FCR_CVSYNCF				(0x1u<<2)
#define	DCMIPP_P1FCR_CFRAMEF				(0x1u<<1)
#define	DCMIPP_P1FCR_CLINEF					(0x1u<<0)

// P1CFSCR Configuration

#define	DCMIPP_P1CFSCR_PIPEN				(0x1u<<31)
#define	DCMIPP_P1CFSCR_FDTFEN				(0x1u<<30)
#define	DCMIPP_P1CFSCR_FDTF					(0x3Fu<<24)
#define	DCMIPP_P1CFSCR_FDTF_0				(0x1u<<24)
#define	DCMIPP_P1CFSCR_VC					(0x3u<<19)
#define	DCMIPP_P1CFSCR_VC_0					(0x1u<<19)
#define	DCMIPP_P1CFSCR_PIPEDIFF				(0x1u<<18)
#define	DCMIPP_P1CFSCR_DTMODE				(0x3u<<16)
#define	DCMIPP_P1CFSCR_DTMODE_0				(0x1u<<16)
#define	DCMIPP_P1CFSCR_DTIDB				(0x3Fu<<8)
#define	DCMIPP_P1CFSCR_DTIDB_0				(0x1u<<8)
#define	DCMIPP_P1CFSCR_DTIDA				(0x3Fu<<0)
#define	DCMIPP_P1CFSCR_DTIDA_0				(0x1u<<0)

#define	DCMIPP_P1CFSCR_PIPEN_B_0X0			(0x0u<<31)
#define	DCMIPP_P1CFSCR_PIPEN_B_0X1			(0x1u<<31)
#define	DCMIPP_P1CFSCR_FDTFEN_B_0X0			(0x0u<<30)
#define	DCMIPP_P1CFSCR_FDTFEN_B_0X1			(0x1u<<30)
#define	DCMIPP_P1CFSCR_PIPEDIFF_B_0X0		(0x0u<<18)
#define	DCMIPP_P1CFSCR_PIPEDIFF_B_0X1		(0x1u<<18)
#define	DCMIPP_P1CFSCR_DTMODE_B_0X0			(0x0u<<16)
#define	DCMIPP_P1CFSCR_DTMODE_B_0X1			(0x1u<<16)

// P1CBPRCR Configuration

#define	DCMIPP_P1CBPRCR_STRENGTH			(0x7u<<1)
#define	DCMIPP_P1CBPRCR_STRENGTH_0			(0x1u<<1)
#define	DCMIPP_P1CBPRCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CBPRCR_STRENGTH_B_0X0		(0x0u<<1)
#define	DCMIPP_P1CBPRCR_ENABLE_B_0X0		(0x0u<<0)
#define	DCMIPP_P1CBPRCR_ENABLE_B_0X1		(0x1u<<0)

// P1CBLCCR Configuration

#define	DCMIPP_P1CBLCCR_BLCR				(0xFFu<<24)
#define	DCMIPP_P1CBLCCR_BLCR_0				(0x1u<<24)
#define	DCMIPP_P1CBLCCR_BLCG				(0xFFu<<16)
#define	DCMIPP_P1CBLCCR_BLCG_0				(0x1u<<16)
#define	DCMIPP_P1CBLCCR_BLCB				(0xFFu<<8)
#define	DCMIPP_P1CBLCCR_BLCB_0				(0x1u<<8)
#define	DCMIPP_P1CBLCCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CBLCCR_ENABLE_B_0X0		(0x0u<<0)
#define	DCMIPP_P1CBLCCR_ENABLE_B_0X1		(0x1u<<0)

// P1CEXCR1 Configuration

#define	DCMIPP_P1CEXCR1_SHFR				(0x7u<<28)
#define	DCMIPP_P1CEXCR1_SHFR_0				(0x1u<<28)
#define	DCMIPP_P1CEXCR1_MULTR				(0xFFu<<20)
#define	DCMIPP_P1CEXCR1_MULTR_0				(0x1u<<20)
#define	DCMIPP_P1CEXCR1_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CEXCR1_ENABLE_B_0X0		(0x0u<<0)
#define	DCMIPP_P1CEXCR1_ENABLE_B_0X1		(0x1u<<0)

// P1CEXCR2 Configuration

#define	DCMIPP_P1CEXCR2_SHFG				(0x7u<<28)
#define	DCMIPP_P1CEXCR2_SHFG_0				(0x1u<<28)
#define	DCMIPP_P1CEXCR2_MULTG				(0xFFu<<20)
#define	DCMIPP_P1CEXCR2_MULTG_0				(0x1u<<20)
#define	DCMIPP_P1CEXCR2_SHFB				(0x7u<<12)
#define	DCMIPP_P1CEXCR2_SHFB_0				(0x1u<<12)
#define	DCMIPP_P1CEXCR2_MULTB				(0xFFu<<4)
#define	DCMIPP_P1CEXCR2_MULTB_0				(0x1u<<4)

// P1CST1CR Configuration

