hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_P1CST1CR_ACCU				(0xFFFFFFu<<8)
#define	DCMIPP_P1CST1CR_ACCU_0				(0x1u<<8)
#define	DCMIPP_P1CST1CR_MODE				(0x1u<<7)
#define	DCMIPP_P1CST1CR_SRC					(0x7u<<4)
#define	DCMIPP_P1CST1CR_SRC_0				(0x1u<<4)
#define	DCMIPP_P1CST1CR_BINS				(0x3u<<2)
#define	DCMIPP_P1CST1CR_BINS_0				(0x1u<<2)
#define	DCMIPP_P1CST1CR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CST1CR_MODE_B_0X0			(0x0u<<7)
#define	DCMIPP_P1CST1CR_MODE_B_0X1			(0x1u<<7)
#define	DCMIPP_P1CST1CR_BINS_B_0X0			(0x0u<<2)
#define	DCMIPP_P1CST1CR_BINS_B_0X1			(0x1u<<2)
#define	DCMIPP_P1CST1CR_ENABLE_B_0X0		(0x0u<<0)
#define	DCMIPP_P1CST1CR_ENABLE_B_0X1		(0x1u<<0)

// P1CST2CR Configuration

#define	DCMIPP_P1CST2CR_ACCU				(0xFFFFFFu<<8)
#define	DCMIPP_P1CST2CR_ACCU_0				(0x1u<<8)
#define	DCMIPP_P1CST2CR_MODE				(0x1u<<7)
#define	DCMIPP_P1CST2CR_SRC					(0x7u<<4)
#define	DCMIPP_P1CST2CR_SRC_0				(0x1u<<4)
#define	DCMIPP_P1CST2CR_BINS				(0x3u<<2)
#define	DCMIPP_P1CST2CR_BINS_0				(0x1u<<2)
#define	DCMIPP_P1CST2CR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CST2CR_MODE_B_0X0			(0x0u<<7)
#define	DCMIPP_P1CST2CR_MODE_B_0X1			(0x1u<<7)
#define	DCMIPP_P1CST2CR_BINS_B_0X0			(0x0u<<2)
#define	DCMIPP_P1CST2CR_BINS_B_0X1			(0x1u<<2)
#define	DCMIPP_P1CST2CR_ENABLE_B_0X0		(0x0u<<0)
#define	DCMIPP_P1CST2CR_ENABLE_B_0X1		(0x1u<<0)

// P1CST3CR Configuration

#define	DCMIPP_P1CST3CR_ACCU				(0xFFFFFFu<<8)
#define	DCMIPP_P1CST3CR_ACCU_0				(0x1u<<8)
#define	DCMIPP_P1CST3CR_MODE				(0x1u<<7)
#define	DCMIPP_P1CST3CR_SRC					(0x7u<<4)
#define	DCMIPP_P1CST3CR_SRC_0				(0x1u<<4)
#define	DCMIPP_P1CST3CR_BINS				(0x3u<<2)
#define	DCMIPP_P1CST3CR_BINS_0				(0x1u<<2)
#define	DCMIPP_P1CST3CR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CST3CR_MODE_B_0X0			(0x0u<<7)
#define	DCMIPP_P1CST3CR_MODE_B_0X1			(0x1u<<7)
#define	DCMIPP_P1CST3CR_BINS_B_0X0			(0x0u<<2)
#define	DCMIPP_P1CST3CR_BINS_B_0X1			(0x1u<<2)
#define	DCMIPP_P1CST3CR_ENABLE_B_0X0		(0x0u<<0)
#define	DCMIPP_P1CST3CR_ENABLE_B_0X1		(0x1u<<0)

// P1CSTSTR Configuration

#define	DCMIPP_P1CSTSTR_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1CSTSTR_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1CSTSTR_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1CSTSTR_HSTART_0			(0x1u<<0)

// P1CSTSZR Configuration

#define	DCMIPP_P1CSTSZR_CROPEN				(0x1u<<31)
#define	DCMIPP_P1CSTSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1CSTSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1CSTSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1CSTSZR_HSIZE_0				(0x1u<<0)

#define	DCMIPP_P1CSTSZR_CROPEN_B_0X0		(0x0u<<31)
#define	DCMIPP_P1CSTSZR_CROPEN_B_0X1		(0x1u<<31)

// P1CCCCR Configuration

#define	DCMIPP_P1CCCCR_CLAMP				(0x1u<<2)
#define	DCMIPP_P1CCCCR_TYPE					(0x1u<<1)
#define	DCMIPP_P1CCCCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CCCCR_CLAMP_B_0X0			(0x0u<<2)
#define	DCMIPP_P1CCCCR_CLAMP_B_0X1			(0x1u<<2)
#define	DCMIPP_P1CCCCR_TYPE_B_0X0			(0x0u<<1)
#define	DCMIPP_P1CCCCR_TYPE_B_0X1			(0x1u<<1)
#define	DCMIPP_P1CCCCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1CCCCR_ENABLE_B_0X1			(0x1u<<0)

// P1CCCRR1 Configuration

#define	DCMIPP_P1CCCRR1_RG					(0x7FFu<<16)
#define	DCMIPP_P1CCCRR1_RG_0				(0x1u<<16)
#define	DCMIPP_P1CCCRR1_RR					(0x7FFu<<0)
#define	DCMIPP_P1CCCRR1_RR_0				(0x1u<<0)

// P1CCCRR2 Configuration

#define	DCMIPP_P1CCCRR2_RA					(0x3FFu<<16)
#define	DCMIPP_P1CCCRR2_RA_0				(0x1u<<16)
#define	DCMIPP_P1CCCRR2_RB					(0x7FFu<<0)
#define	DCMIPP_P1CCCRR2_RB_0				(0x1u<<0)

// P1CCCGR1 Configuration

#define	DCMIPP_P1CCCGR1_GG					(0x7FFu<<16)
#define	DCMIPP_P1CCCGR1_GG_0				(0x1u<<16)
#define	DCMIPP_P1CCCGR1_GR					(0x7FFu<<0)
#define	DCMIPP_P1CCCGR1_GR_0				(0x1u<<0)

// P1CCCGR2 Configuration

#define	DCMIPP_P1CCCGR2_GA					(0x3FFu<<16)
#define	DCMIPP_P1CCCGR2_GA_0				(0x1u<<16)
#define	DCMIPP_P1CCCGR2_GB					(0x7FFu<<0)
#define	DCMIPP_P1CCCGR2_GB_0				(0x1u<<0)

// P1CCCBR1 Configuration

#define	DCMIPP_P1CCCBR1_BG					(0x7FFu<<16)
#define	DCMIPP_P1CCCBR1_BG_0				(0x1u<<16)
#define	DCMIPP_P1CCCBR1_BR					(0x7FFu<<0)
#define	DCMIPP_P1CCCBR1_BR_0				(0x1u<<0)

// P1CCCBR2 Configuration

#define	DCMIPP_P1CCCBR2_BA					(0x3FFu<<16)
#define	DCMIPP_P1CCCBR2_BA_0				(0x1u<<16)
#define	DCMIPP_P1CCCBR2_BB					(0x7FFu<<0)
#define	DCMIPP_P1CCCBR2_BB_0				(0x1u<<0)

// P1CCTCR1 Configuration

#define	DCMIPP_P1CCTCR1_LUM0				(0x3Fu<<9)
#define	DCMIPP_P1CCTCR1_LUM0_0				(0x1u<<9)
#define	DCMIPP_P1CCTCR1_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CCTCR1_ENABLE_B_0X0		(0x0u<<0)
#define	DCMIPP_P1CCTCR1_ENABLE_B_0X1		(0x1u<<0)

// P1CCTCR2 Configuration

#define	DCMIPP_P1CCTCR2_LUM1				(0x3Fu<<25)
#define	DCMIPP_P1CCTCR2_LUM1_0				(0x1u<<25)
#define	DCMIPP_P1CCTCR2_LUM2				(0x3Fu<<17)
#define	DCMIPP_P1CCTCR2_LUM2_0				(0x1u<<17)
#define	DCMIPP_P1CCTCR2_LUM3				(0x3Fu<<9)
#define	DCMIPP_P1CCTCR2_LUM3_0				(0x1u<<9)
#define	DCMIPP_P1CCTCR2_LUM4				(0x3Fu<<1)
#define	DCMIPP_P1CCTCR2_LUM4_0				(0x1u<<1)

// P1CCTCR3 Configuration

#define	DCMIPP_P1CCTCR3_LUM5				(0x3Fu<<25)
#define	DCMIPP_P1CCTCR3_LUM5_0				(0x1u<<25)
#define	DCMIPP_P1CCTCR3_LUM6				(0x3Fu<<17)
#define	DCMIPP_P1CCTCR3_LUM6_0				(0x1u<<17)
#define	DCMIPP_P1CCTCR3_LUM7				(0x3Fu<<9)
#define	DCMIPP_P1CCTCR3_LUM7_0				(0x1u<<9)
#define	DCMIPP_P1CCTCR3_LUM8				(0x3Fu<<1)
#define	DCMIPP_P1CCTCR3_LUM8_0				(0x1u<<1)

// P1CFCTCR Configuration

#define	DCMIPP_P1CFCTCR_CPTREQ				(0x1u<<3)
#define	DCMIPP_P1CFCTCR_CPTMODE				(0x1u<<2)
#define	DCMIPP_P1CFCTCR_FRATE				(0x3u<<0)
#define	DCMIPP_P1CFCTCR_FRATE_0				(0x1u<<0)

#define	DCMIPP_P1CFCTCR_CPTREQ_B_0X0		(0x0u<<3)
#define	DCMIPP_P1CFCTCR_CPTREQ_B_0X1		(0x1u<<3)
#define	DCMIPP_P1CFCTCR_CPTMODE_B_0X0		(0x0u<<2)
#define	DCMIPP_P1CFCTCR_CPTMODE_B_0X1		(0x1u<<2)
#define	DCMIPP_P1CFCTCR_FRATE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1CFCTCR_FRATE_B_0X1			(0x1u<<0)
#define	DCMIPP_P1CFCTCR_FRATE_B_0X2			(0x2u<<0)
#define	DCMIPP_P1CFCTCR_FRATE_B_0X3			(0x3u<<0)

// P1CCRSTR Configuration

#define	DCMIPP_P1CCRSTR_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1CCRSTR_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1CCRSTR_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1CCRSTR_HSTART_0			(0x1u<<0)

// P1CCRSZR Configuration

#define	DCMIPP_P1CCRSZR_ENABLE				(0x1u<<31)
#define	DCMIPP_P1CCRSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1CCRSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P1CCRSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1CCRSZR_HSIZE_0				(0x1u<<0)

#define	DCMIPP_P1CCRSZR_ENABLE_B_0X0		(0x0u<<31)
#define	DCMIPP_P1CCRSZR_ENABLE_B_0X1		(0x1u<<31)

// P1CDCCR Configuration

#define	DCMIPP_P1CDCCR_VDEC					(0x3u<<3)
#define	DCMIPP_P1CDCCR_VDEC_0				(0x1u<<3)
#define	DCMIPP_P1CDCCR_HDEC					(0x3u<<1)
#define	DCMIPP_P1CDCCR_HDEC_0				(0x1u<<1)
#define	DCMIPP_P1CDCCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P1CDCCR_VDEC_B_0X0			(0x0u<<3)
#define	DCMIPP_P1CDCCR_VDEC_B_0X1			(0x1u<<3)
#define	DCMIPP_P1CDCCR_HDEC_B_0X0			(0x0u<<1)
#define	DCMIPP_P1CDCCR_HDEC_B_0X1			(0x1u<<1)
#define	DCMIPP_P1CDCCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P1CDCCR_ENABLE_B_0X1			(0x1u<<0)

