hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
// P1CRI6CR2 Configuration

#define	DCMIPP_P1CRI6CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1CRI6CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P1CRI6CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1CRI6CR2_HSIZE_0			(0x1u<<0)

// P1CRI7CR1 Configuration

#define	DCMIPP_P1CRI7CR1_CLR				(0x3u<<28)
#define	DCMIPP_P1CRI7CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1CRI7CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1CRI7CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1CRI7CR1_CLG				(0x3u<<14)
#define	DCMIPP_P1CRI7CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1CRI7CR1_CLB				(0x3u<<12)
#define	DCMIPP_P1CRI7CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1CRI7CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1CRI7CR1_HSTART_0			(0x1u<<0)

// P1CRI7CR2 Configuration

#define	DCMIPP_P1CRI7CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1CRI7CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P1CRI7CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1CRI7CR2_HSIZE_0			(0x1u<<0)

// P1CRI8CR1 Configuration

#define	DCMIPP_P1CRI8CR1_CLR				(0x3u<<28)
#define	DCMIPP_P1CRI8CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P1CRI8CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P1CRI8CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P1CRI8CR1_CLG				(0x3u<<14)
#define	DCMIPP_P1CRI8CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P1CRI8CR1_CLB				(0x3u<<12)
#define	DCMIPP_P1CRI8CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P1CRI8CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P1CRI8CR1_HSTART_0			(0x1u<<0)

// P1CRI8CR2 Configuration

#define	DCMIPP_P1CRI8CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P1CRI8CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P1CRI8CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P1CRI8CR2_HSIZE_0			(0x1u<<0)

// P1CPPCR Configuration

#define	DCMIPP_P1CPPCR_LMAWE				(0x1u<<20)
#define	DCMIPP_P1CPPCR_LMAWM				(0x7u<<17)
#define	DCMIPP_P1CPPCR_LMAWM_0				(0x1u<<17)
#define	DCMIPP_P1CPPCR_DBM					(0x1u<<16)
#define	DCMIPP_P1CPPCR_LINEMULT				(0x7u<<13)
#define	DCMIPP_P1CPPCR_LINEMULT_0			(0x1u<<13)
#define	DCMIPP_P1CPPCR_SWAPRB				(0x1u<<4)
#define	DCMIPP_P1CPPCR_FORMAT				(0xFu<<0)
#define	DCMIPP_P1CPPCR_FORMAT_0				(0x1u<<0)

#define	DCMIPP_P1CPPCR_LMAWE_B_0X0			(0x0u<<20)
#define	DCMIPP_P1CPPCR_LMAWE_B_0X1			(0x1u<<20)
#define	DCMIPP_P1CPPCR_LMAWM_B_0X0			(0x0u<<17)
#define	DCMIPP_P1CPPCR_LMAWM_B_0X1			(0x1u<<17)
#define	DCMIPP_P1CPPCR_LMAWM_B_0X2			(0x2u<<17)
#define	DCMIPP_P1CPPCR_LMAWM_B_0X3			(0x3u<<17)
#define	DCMIPP_P1CPPCR_LMAWM_B_0X4			(0x4u<<17)
#define	DCMIPP_P1CPPCR_LMAWM_B_0X5			(0x5u<<17)
#define	DCMIPP_P1CPPCR_LMAWM_B_0X6			(0x6u<<17)
#define	DCMIPP_P1CPPCR_LMAWM_B_0X7			(0x7u<<17)
#define	DCMIPP_P1CPPCR_DBM_B_0X0			(0x0u<<16)
#define	DCMIPP_P1CPPCR_DBM_B_0X1			(0x1u<<16)
#define	DCMIPP_P1CPPCR_LINEMULT_B_0X0		(0x0u<<13)
#define	DCMIPP_P1CPPCR_LINEMULT_B_0X1		(0x1u<<13)
#define	DCMIPP_P1CPPCR_LINEMULT_B_0X2		(0x2u<<13)
#define	DCMIPP_P1CPPCR_LINEMULT_B_0X3		(0x3u<<13)
#define	DCMIPP_P1CPPCR_LINEMULT_B_0X4		(0x4u<<13)
#define	DCMIPP_P1CPPCR_LINEMULT_B_0X5		(0x5u<<13)
#define	DCMIPP_P1CPPCR_LINEMULT_B_0X6		(0x6u<<13)
#define	DCMIPP_P1CPPCR_LINEMULT_B_0X7		(0x7u<<13)
#define	DCMIPP_P1CPPCR_SWAPRB_B_0X0			(0x0u<<4)
#define	DCMIPP_P1CPPCR_SWAPRB_B_0X1			(0x1u<<4)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X0			(0x0u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X1			(0x1u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X2			(0x2u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X3			(0x3u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X4			(0x4u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X5			(0x5u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X6			(0x6u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X7			(0x7u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X8			(0x8u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0X9			(0x9u<<0)
#define	DCMIPP_P1CPPCR_FORMAT_B_0XA			(0xAu<<0)

// P1CPPM0AR1 Configuration

#define	DCMIPP_P1CPPM0AR1_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1CPPM0AR1_M0A_0				(0x1u<<0)

// P1CPPM0AR2 Configuration

#define	DCMIPP_P1CPPM0AR2_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1CPPM0AR2_M0A_0				(0x1u<<0)

// P1CPPM0PR Configuration

#define	DCMIPP_P1CPPM0PR_PITCH				(0x7FFFu<<0)
#define	DCMIPP_P1CPPM0PR_PITCH_0			(0x1u<<0)

// P1CPPM1AR1 Configuration

#define	DCMIPP_P1CPPM1AR1_M1A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1CPPM1AR1_M1A_0				(0x1u<<0)

// P1CPPM1AR2 Configuration

#define	DCMIPP_P1CPPM1AR2_M1A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1CPPM1AR2_M1A_0				(0x1u<<0)

// P1CPPM1PR Configuration

#define	DCMIPP_P1CPPM1PR_PITCH				(0x7FFFu<<0)
#define	DCMIPP_P1CPPM1PR_PITCH_0			(0x1u<<0)

// P1CPPM2AR1 Configuration

#define	DCMIPP_P1CPPM2AR1_M2A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1CPPM2AR1_M2A_0				(0x1u<<0)

// P1CPPM2AR2 Configuration

#define	DCMIPP_P1CPPM2AR2_M2A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P1CPPM2AR2_M2A_0				(0x1u<<0)

// P2FSCR Configuration

#define	DCMIPP_P2FSCR_PIPEN					(0x1u<<31)
#define	DCMIPP_P2FSCR_FDTFEN				(0x1u<<30)
#define	DCMIPP_P2FSCR_FDTF					(0x3Fu<<24)
#define	DCMIPP_P2FSCR_FDTF_0				(0x1u<<24)
#define	DCMIPP_P2FSCR_VC					(0x3u<<19)
#define	DCMIPP_P2FSCR_VC_0					(0x1u<<19)
#define	DCMIPP_P2FSCR_DTIDA					(0x3Fu<<0)
#define	DCMIPP_P2FSCR_DTIDA_0				(0x1u<<0)

#define	DCMIPP_P2FSCR_PIPEN_B_0X0			(0x0u<<31)
#define	DCMIPP_P2FSCR_PIPEN_B_0X1			(0x1u<<31)
#define	DCMIPP_P2FSCR_FDTFEN_B_0X0			(0x0u<<30)
#define	DCMIPP_P2FSCR_FDTFEN_B_0X1			(0x1u<<30)

// P2FCTCR Configuration

#define	DCMIPP_P2FCTCR_CPTREQ				(0x1u<<3)
#define	DCMIPP_P2FCTCR_CPTMODE				(0x1u<<2)
#define	DCMIPP_P2FCTCR_FRATE				(0x3u<<0)
#define	DCMIPP_P2FCTCR_FRATE_0				(0x1u<<0)

#define	DCMIPP_P2FCTCR_CPTREQ_B_0X0			(0x0u<<3)
#define	DCMIPP_P2FCTCR_CPTREQ_B_0X1			(0x1u<<3)
#define	DCMIPP_P2FCTCR_CPTMODE_B_0X0		(0x0u<<2)
#define	DCMIPP_P2FCTCR_CPTMODE_B_0X1		(0x1u<<2)
#define	DCMIPP_P2FCTCR_FRATE_B_0X0			(0x0u<<0)
#define	DCMIPP_P2FCTCR_FRATE_B_0X1			(0x1u<<0)
#define	DCMIPP_P2FCTCR_FRATE_B_0X2			(0x2u<<0)
#define	DCMIPP_P2FCTCR_FRATE_B_0X3			(0x3u<<0)

// P2CRSTR Configuration

#define	DCMIPP_P2CRSTR_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CRSTR_VSTART_0				(0x1u<<16)
#define	DCMIPP_P2CRSTR_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CRSTR_HSTART_0				(0x1u<<0)

// P2CRSZR Configuration

#define	DCMIPP_P2CRSZR_ENABLE				(0x1u<<31)
#define	DCMIPP_P2CRSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CRSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2CRSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CRSZR_HSIZE_0				(0x1u<<0)

#define	DCMIPP_P2CRSZR_ENABLE_B_0X0			(0x0u<<31)
#define	DCMIPP_P2CRSZR_ENABLE_B_0X1			(0x1u<<31)

// P2DCCR Configuration

#define	DCMIPP_P2DCCR_VDEC					(0x3u<<3)
#define	DCMIPP_P2DCCR_VDEC_0				(0x1u<<3)
#define	DCMIPP_P2DCCR_HDEC					(0x3u<<1)
#define	DCMIPP_P2DCCR_HDEC_0				(0x1u<<1)
#define	DCMIPP_P2DCCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P2DCCR_VDEC_B_0X0			(0x0u<<3)
#define	DCMIPP_P2DCCR_VDEC_B_0X1			(0x1u<<3)
#define	DCMIPP_P2DCCR_HDEC_B_0X0			(0x0u<<1)
#define	DCMIPP_P2DCCR_HDEC_B_0X1			(0x1u<<1)
#define	DCMIPP_P2DCCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P2DCCR_ENABLE_B_0X1			(0x1u<<0)

// P2DSCR Configuration

#define	DCMIPP_P2DSCR_ENABLE				(0x1u<<31)
#define	DCMIPP_P2DSCR_VDIV					(0x3FFu<<16)
#define	DCMIPP_P2DSCR_VDIV_0				(0x1u<<16)
#define	DCMIPP_P2DSCR_HDIV					(0x3FFu<<0)
#define	DCMIPP_P2DSCR_HDIV_0				(0x1u<<0)

#define	DCMIPP_P2DSCR_ENABLE_B_0X0			(0x0u<<31)
#define	DCMIPP_P2DSCR_ENABLE_B_0X1			(0x1u<<31)

// P2DSRTIOR Configuration

