hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_P2DSRTIOR_VRATIO				(0xFFFFu<<16)
#define	DCMIPP_P2DSRTIOR_VRATIO_0			(0x1u<<16)
#define	DCMIPP_P2DSRTIOR_HRATIO				(0xFFFFu<<0)
#define	DCMIPP_P2DSRTIOR_HRATIO_0			(0x1u<<0)

// P2DSSZR Configuration

#define	DCMIPP_P2DSSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2DSSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2DSSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2DSSZR_HSIZE_0				(0x1u<<0)

// P2CMRICR Configuration

#define	DCMIPP_P2CMRICR_ROI8EN				(0x1u<<23)
#define	DCMIPP_P2CMRICR_ROI7EN				(0x1u<<22)
#define	DCMIPP_P2CMRICR_ROI6EN				(0x1u<<21)
#define	DCMIPP_P2CMRICR_ROI5EN				(0x1u<<20)
#define	DCMIPP_P2CMRICR_ROI4EN				(0x1u<<19)
#define	DCMIPP_P2CMRICR_ROI3EN				(0x1u<<18)
#define	DCMIPP_P2CMRICR_ROI2EN				(0x1u<<17)
#define	DCMIPP_P2CMRICR_ROI1EN				(0x1u<<16)
#define	DCMIPP_P2CMRICR_ROILSZ				(0x3u<<0)
#define	DCMIPP_P2CMRICR_ROILSZ_0			(0x1u<<0)

#define	DCMIPP_P2CMRICR_ROI8EN_B_0X0		(0x0u<<23)
#define	DCMIPP_P2CMRICR_ROI8EN_B_0X1		(0x1u<<23)
#define	DCMIPP_P2CMRICR_ROI7EN_B_0X0		(0x0u<<22)
#define	DCMIPP_P2CMRICR_ROI7EN_B_0X1		(0x1u<<22)
#define	DCMIPP_P2CMRICR_ROI6EN_B_0X0		(0x0u<<21)
#define	DCMIPP_P2CMRICR_ROI6EN_B_0X1		(0x1u<<21)
#define	DCMIPP_P2CMRICR_ROI5EN_B_0X0		(0x0u<<20)
#define	DCMIPP_P2CMRICR_ROI5EN_B_0X1		(0x1u<<20)
#define	DCMIPP_P2CMRICR_ROI4EN_B_0X0		(0x0u<<19)
#define	DCMIPP_P2CMRICR_ROI4EN_B_0X1		(0x1u<<19)
#define	DCMIPP_P2CMRICR_ROI3EN_B_0X0		(0x0u<<18)
#define	DCMIPP_P2CMRICR_ROI3EN_B_0X1		(0x1u<<18)
#define	DCMIPP_P2CMRICR_ROI2EN_B_0X0		(0x0u<<17)
#define	DCMIPP_P2CMRICR_ROI2EN_B_0X1		(0x1u<<17)
#define	DCMIPP_P2CMRICR_ROI1EN_B_0X0		(0x0u<<16)
#define	DCMIPP_P2CMRICR_ROI1EN_B_0X1		(0x1u<<16)
#define	DCMIPP_P2CMRICR_ROILSZ_B_0X0		(0x0u<<0)
#define	DCMIPP_P2CMRICR_ROILSZ_B_0X1		(0x1u<<0)
#define	DCMIPP_P2CMRICR_ROILSZ_B_0X2		(0x2u<<0)
#define	DCMIPP_P2CMRICR_ROILSZ_B_0X3		(0x3u<<0)

// P2RI1CR1 Configuration

#define	DCMIPP_P2RI1CR1_CLR					(0x3u<<28)
#define	DCMIPP_P2RI1CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2RI1CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2RI1CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2RI1CR1_CLG					(0x3u<<14)
#define	DCMIPP_P2RI1CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2RI1CR1_CLB					(0x3u<<12)
#define	DCMIPP_P2RI1CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2RI1CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2RI1CR1_HSTART_0			(0x1u<<0)

// P2RI1CR2 Configuration

#define	DCMIPP_P2RI1CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2RI1CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2RI1CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2RI1CR2_HSIZE_0				(0x1u<<0)

// P2RI2CR1 Configuration

#define	DCMIPP_P2RI2CR1_CLR					(0x3u<<28)
#define	DCMIPP_P2RI2CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2RI2CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2RI2CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2RI2CR1_CLG					(0x3u<<14)
#define	DCMIPP_P2RI2CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2RI2CR1_CLB					(0x3u<<12)
#define	DCMIPP_P2RI2CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2RI2CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2RI2CR1_HSTART_0			(0x1u<<0)

// P2RI2CR2 Configuration

#define	DCMIPP_P2RI2CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2RI2CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2RI2CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2RI2CR2_HSIZE_0				(0x1u<<0)

// P2RI3CR1 Configuration

#define	DCMIPP_P2RI3CR1_CLR					(0x3u<<28)
#define	DCMIPP_P2RI3CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2RI3CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2RI3CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2RI3CR1_CLG					(0x3u<<14)
#define	DCMIPP_P2RI3CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2RI3CR1_CLB					(0x3u<<12)
#define	DCMIPP_P2RI3CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2RI3CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2RI3CR1_HSTART_0			(0x1u<<0)

// P2RI3CR2 Configuration

#define	DCMIPP_P2RI3CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2RI3CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2RI3CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2RI3CR2_HSIZE_0				(0x1u<<0)

// P2RI4CR1 Configuration

#define	DCMIPP_P2RI4CR1_CLR					(0x3u<<28)
#define	DCMIPP_P2RI4CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2RI4CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2RI4CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2RI4CR1_CLG					(0x3u<<14)
#define	DCMIPP_P2RI4CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2RI4CR1_CLB					(0x3u<<12)
#define	DCMIPP_P2RI4CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2RI4CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2RI4CR1_HSTART_0			(0x1u<<0)

// P2RI4CR2 Configuration

#define	DCMIPP_P2RI4CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2RI4CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2RI4CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2RI4CR2_HSIZE_0				(0x1u<<0)

// P2RI5CR1 Configuration

#define	DCMIPP_P2RI5CR1_CLR					(0x3u<<28)
#define	DCMIPP_P2RI5CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2RI5CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2RI5CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2RI5CR1_CLG					(0x3u<<14)
#define	DCMIPP_P2RI5CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2RI5CR1_CLB					(0x3u<<12)
#define	DCMIPP_P2RI5CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2RI5CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2RI5CR1_HSTART_0			(0x1u<<0)

// P2RI5CR2 Configuration

#define	DCMIPP_P2RI5CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2RI5CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2RI5CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2RI5CR2_HSIZE_0				(0x1u<<0)

// P2RI6CR1 Configuration

#define	DCMIPP_P2RI6CR1_CLR					(0x3u<<28)
#define	DCMIPP_P2RI6CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2RI6CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2RI6CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2RI6CR1_CLG					(0x3u<<14)
#define	DCMIPP_P2RI6CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2RI6CR1_CLB					(0x3u<<12)
#define	DCMIPP_P2RI6CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2RI6CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2RI6CR1_HSTART_0			(0x1u<<0)

// P2RI6CR2 Configuration

#define	DCMIPP_P2RI6CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2RI6CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2RI6CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2RI6CR2_HSIZE_0				(0x1u<<0)

// P2RI7CR1 Configuration

#define	DCMIPP_P2RI7CR1_CLR					(0x3u<<28)
#define	DCMIPP_P2RI7CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2RI7CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2RI7CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2RI7CR1_CLG					(0x3u<<14)
#define	DCMIPP_P2RI7CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2RI7CR1_CLB					(0x3u<<12)
#define	DCMIPP_P2RI7CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2RI7CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2RI7CR1_HSTART_0			(0x1u<<0)

// P2RI7CR2 Configuration

