hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_P2RI7CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2RI7CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2RI7CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2RI7CR2_HSIZE_0				(0x1u<<0)

// P2RI8CR1 Configuration

#define	DCMIPP_P2RI8CR1_CLR					(0x3u<<28)
#define	DCMIPP_P2RI8CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2RI8CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2RI8CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2RI8CR1_CLG					(0x3u<<14)
#define	DCMIPP_P2RI8CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2RI8CR1_CLB					(0x3u<<12)
#define	DCMIPP_P2RI8CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2RI8CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2RI8CR1_HSTART_0			(0x1u<<0)

// P2RI8CR2 Configuration

#define	DCMIPP_P2RI8CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2RI8CR2_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2RI8CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2RI8CR2_HSIZE_0				(0x1u<<0)

// P2GMCR Configuration

#define	DCMIPP_P2GMCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P2GMCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P2GMCR_ENABLE_B_0X1			(0x1u<<0)

// P2PPCR Configuration

#define	DCMIPP_P2PPCR_LMAWE					(0x1u<<20)
#define	DCMIPP_P2PPCR_LMAWM					(0x7u<<17)
#define	DCMIPP_P2PPCR_LMAWM_0				(0x1u<<17)
#define	DCMIPP_P2PPCR_DBM					(0x1u<<16)
#define	DCMIPP_P2PPCR_LINEMULT				(0x7u<<13)
#define	DCMIPP_P2PPCR_LINEMULT_0			(0x1u<<13)
#define	DCMIPP_P2PPCR_SWAPRB				(0x1u<<4)
#define	DCMIPP_P2PPCR_FORMAT				(0xFu<<0)
#define	DCMIPP_P2PPCR_FORMAT_0				(0x1u<<0)

#define	DCMIPP_P2PPCR_LMAWE_B_0X0			(0x0u<<20)
#define	DCMIPP_P2PPCR_LMAWE_B_0X1			(0x1u<<20)
#define	DCMIPP_P2PPCR_LMAWM_B_0X0			(0x0u<<17)
#define	DCMIPP_P2PPCR_LMAWM_B_0X1			(0x1u<<17)
#define	DCMIPP_P2PPCR_LMAWM_B_0X2			(0x2u<<17)
#define	DCMIPP_P2PPCR_LMAWM_B_0X3			(0x3u<<17)
#define	DCMIPP_P2PPCR_LMAWM_B_0X4			(0x4u<<17)
#define	DCMIPP_P2PPCR_LMAWM_B_0X5			(0x5u<<17)
#define	DCMIPP_P2PPCR_LMAWM_B_0X6			(0x6u<<17)
#define	DCMIPP_P2PPCR_LMAWM_B_0X7			(0x7u<<17)
#define	DCMIPP_P2PPCR_DBM_B_0X0				(0x0u<<16)
#define	DCMIPP_P2PPCR_DBM_B_0X1				(0x1u<<16)
#define	DCMIPP_P2PPCR_LINEMULT_B_0X0		(0x0u<<13)
#define	DCMIPP_P2PPCR_LINEMULT_B_0X1		(0x1u<<13)
#define	DCMIPP_P2PPCR_LINEMULT_B_0X2		(0x2u<<13)
#define	DCMIPP_P2PPCR_LINEMULT_B_0X3		(0x3u<<13)
#define	DCMIPP_P2PPCR_LINEMULT_B_0X4		(0x4u<<13)
#define	DCMIPP_P2PPCR_LINEMULT_B_0X5		(0x5u<<13)
#define	DCMIPP_P2PPCR_LINEMULT_B_0X6		(0x6u<<13)
#define	DCMIPP_P2PPCR_LINEMULT_B_0X7		(0x7u<<13)
#define	DCMIPP_P2PPCR_SWAPRB_B_0X0			(0x0u<<4)
#define	DCMIPP_P2PPCR_SWAPRB_B_0X1			(0x1u<<4)
#define	DCMIPP_P2PPCR_FORMAT_B_0X0			(0x0u<<0)
#define	DCMIPP_P2PPCR_FORMAT_B_0X1			(0x1u<<0)
#define	DCMIPP_P2PPCR_FORMAT_B_0X2			(0x2u<<0)
#define	DCMIPP_P2PPCR_FORMAT_B_0X3			(0x3u<<0)
#define	DCMIPP_P2PPCR_FORMAT_B_0X4			(0x4u<<0)
#define	DCMIPP_P2PPCR_FORMAT_B_0X5			(0x5u<<0)
#define	DCMIPP_P2PPCR_FORMAT_B_0X6			(0x6u<<0)

// P2PPM0AR1 Configuration

#define	DCMIPP_P2PPM0AR1_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P2PPM0AR1_M0A_0				(0x1u<<0)

// P2PPM0AR2 Configuration

#define	DCMIPP_P2PPM0AR2_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P2PPM0AR2_M0A_0				(0x1u<<0)

// P2PPM0PR Configuration

#define	DCMIPP_P2PPM0PR_PITCH				(0x7FFFu<<0)
#define	DCMIPP_P2PPM0PR_PITCH_0				(0x1u<<0)

// P2STM0AR Configuration

#define	DCMIPP_P2STM0AR_M0A					(0xFFFFFFFFu<<0)
#define	DCMIPP_P2STM0AR_M0A_0				(0x1u<<0)

// P2IER Configuration

#define	DCMIPP_P2IER_OVRIE					(0x1u<<7)
#define	DCMIPP_P2IER_VSYNCIE				(0x1u<<2)
#define	DCMIPP_P2IER_FRAMEIE				(0x1u<<1)
#define	DCMIPP_P2IER_LINEIE					(0x1u<<0)

#define	DCMIPP_P2IER_OVRIE_B_0X0			(0x0u<<7)
#define	DCMIPP_P2IER_OVRIE_B_0X1			(0x1u<<7)
#define	DCMIPP_P2IER_VSYNCIE_B_0X0			(0x0u<<2)
#define	DCMIPP_P2IER_VSYNCIE_B_0X1			(0x1u<<2)
#define	DCMIPP_P2IER_FRAMEIE_B_0X0			(0x0u<<1)
#define	DCMIPP_P2IER_FRAMEIE_B_0X1			(0x1u<<1)
#define	DCMIPP_P2IER_LINEIE_B_0X0			(0x0u<<0)
#define	DCMIPP_P2IER_LINEIE_B_0X1			(0x1u<<0)

// P2SR Configuration

#define	DCMIPP_P2SR_CPTACT					(0x1u<<23)
#define	DCMIPP_P2SR_LSTFRM					(0x1u<<17)
#define	DCMIPP_P2SR_LSTLINE					(0x1u<<16)
#define	DCMIPP_P2SR_OVRF					(0x1u<<7)
#define	DCMIPP_P2SR_VSYNCF					(0x1u<<2)
#define	DCMIPP_P2SR_FRAMEF					(0x1u<<1)
#define	DCMIPP_P2SR_LINEF					(0x1u<<0)

#define	DCMIPP_P2SR_CPTACT_B_0X0			(0x0u<<23)
#define	DCMIPP_P2SR_CPTACT_B_0X1			(0x1u<<23)
#define	DCMIPP_P2SR_OVRF_B_0X0				(0x0u<<7)
#define	DCMIPP_P2SR_OVRF_B_0X1				(0x1u<<7)
#define	DCMIPP_P2SR_FRAMEF_B_0X0			(0x0u<<1)
#define	DCMIPP_P2SR_FRAMEF_B_0X1			(0x1u<<1)

// P2FCR Configuration

#define	DCMIPP_P2FCR_COVRF					(0x1u<<7)
#define	DCMIPP_P2FCR_CVSYNCF				(0x1u<<2)
#define	DCMIPP_P2FCR_CFRAMEF				(0x1u<<1)
#define	DCMIPP_P2FCR_CLINEF					(0x1u<<0)

// P2CFSCR Configuration

#define	DCMIPP_P2CFSCR_PIPEN				(0x1u<<31)
#define	DCMIPP_P2CFSCR_FDTFEN				(0x1u<<30)
#define	DCMIPP_P2CFSCR_FDTF					(0x3Fu<<24)
#define	DCMIPP_P2CFSCR_FDTF_0				(0x1u<<24)
#define	DCMIPP_P2CFSCR_VC					(0x3u<<19)
#define	DCMIPP_P2CFSCR_VC_0					(0x1u<<19)
#define	DCMIPP_P2CFSCR_DTIDA				(0x3Fu<<0)
#define	DCMIPP_P2CFSCR_DTIDA_0				(0x1u<<0)

#define	DCMIPP_P2CFSCR_PIPEN_B_0X0			(0x0u<<31)
#define	DCMIPP_P2CFSCR_PIPEN_B_0X1			(0x1u<<31)
#define	DCMIPP_P2CFSCR_FDTFEN_B_0X0			(0x0u<<30)
#define	DCMIPP_P2CFSCR_FDTFEN_B_0X1			(0x1u<<30)

// P2CFCTCR Configuration

#define	DCMIPP_P2CFCTCR_CPTREQ				(0x1u<<3)
#define	DCMIPP_P2CFCTCR_CPTMODE				(0x1u<<2)
#define	DCMIPP_P2CFCTCR_FRATE				(0x3u<<0)
#define	DCMIPP_P2CFCTCR_FRATE_0				(0x1u<<0)

#define	DCMIPP_P2CFCTCR_CPTREQ_B_0X0		(0x0u<<3)
#define	DCMIPP_P2CFCTCR_CPTREQ_B_0X1		(0x1u<<3)
#define	DCMIPP_P2CFCTCR_CPTMODE_B_0X0		(0x0u<<2)
#define	DCMIPP_P2CFCTCR_CPTMODE_B_0X1		(0x1u<<2)
#define	DCMIPP_P2CFCTCR_FRATE_B_0X0			(0x0u<<0)
#define	DCMIPP_P2CFCTCR_FRATE_B_0X1			(0x1u<<0)
#define	DCMIPP_P2CFCTCR_FRATE_B_0X2			(0x2u<<0)
#define	DCMIPP_P2CFCTCR_FRATE_B_0X3			(0x3u<<0)

// P2CCRSTR Configuration

#define	DCMIPP_P2CCRSTR_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CCRSTR_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2CCRSTR_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CCRSTR_HSTART_0			(0x1u<<0)

