hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
// P2CCRSZR Configuration

#define	DCMIPP_P2CCRSZR_ENABLE				(0x1u<<31)
#define	DCMIPP_P2CCRSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CCRSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2CCRSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CCRSZR_HSIZE_0				(0x1u<<0)

#define	DCMIPP_P2CCRSZR_ENABLE_B_0X0		(0x0u<<31)
#define	DCMIPP_P2CCRSZR_ENABLE_B_0X1		(0x1u<<31)

// P2CDCCR Configuration

#define	DCMIPP_P2CDCCR_VDEC					(0x3u<<3)
#define	DCMIPP_P2CDCCR_VDEC_0				(0x1u<<3)
#define	DCMIPP_P2CDCCR_HDEC					(0x3u<<1)
#define	DCMIPP_P2CDCCR_HDEC_0				(0x1u<<1)
#define	DCMIPP_P2CDCCR_ENABLE				(0x1u<<0)

#define	DCMIPP_P2CDCCR_VDEC_B_0X0			(0x0u<<3)
#define	DCMIPP_P2CDCCR_VDEC_B_0X1			(0x1u<<3)
#define	DCMIPP_P2CDCCR_HDEC_B_0X0			(0x0u<<1)
#define	DCMIPP_P2CDCCR_HDEC_B_0X1			(0x1u<<1)
#define	DCMIPP_P2CDCCR_ENABLE_B_0X0			(0x0u<<0)
#define	DCMIPP_P2CDCCR_ENABLE_B_0X1			(0x1u<<0)

// P2CDSCR Configuration

#define	DCMIPP_P2CDSCR_ENABLE				(0x1u<<31)
#define	DCMIPP_P2CDSCR_VDIV					(0x3FFu<<16)
#define	DCMIPP_P2CDSCR_VDIV_0				(0x1u<<16)
#define	DCMIPP_P2CDSCR_HDIV					(0x3FFu<<0)
#define	DCMIPP_P2CDSCR_HDIV_0				(0x1u<<0)

#define	DCMIPP_P2CDSCR_ENABLE_B_0X0			(0x0u<<31)
#define	DCMIPP_P2CDSCR_ENABLE_B_0X1			(0x1u<<31)

// P2CDSRTIOR Configuration

#define	DCMIPP_P2CDSRTIOR_VRATIO			(0xFFFFu<<16)
#define	DCMIPP_P2CDSRTIOR_VRATIO_0			(0x1u<<16)
#define	DCMIPP_P2CDSRTIOR_HRATIO			(0xFFFFu<<0)
#define	DCMIPP_P2CDSRTIOR_HRATIO_0			(0x1u<<0)

// P2CDSSZR Configuration

#define	DCMIPP_P2CDSSZR_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CDSSZR_VSIZE_0				(0x1u<<16)
#define	DCMIPP_P2CDSSZR_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CDSSZR_HSIZE_0				(0x1u<<0)

// P2CCMRICR Configuration

#define	DCMIPP_P2CCMRICR_ROI8EN				(0x1u<<23)
#define	DCMIPP_P2CCMRICR_ROI7EN				(0x1u<<22)
#define	DCMIPP_P2CCMRICR_ROI6EN				(0x1u<<21)
#define	DCMIPP_P2CCMRICR_ROI5EN				(0x1u<<20)
#define	DCMIPP_P2CCMRICR_ROI4EN				(0x1u<<19)
#define	DCMIPP_P2CCMRICR_ROI3EN				(0x1u<<18)
#define	DCMIPP_P2CCMRICR_ROI2EN				(0x1u<<17)
#define	DCMIPP_P2CCMRICR_ROI1EN				(0x1u<<16)
#define	DCMIPP_P2CCMRICR_ROILSZ				(0x3u<<0)
#define	DCMIPP_P2CCMRICR_ROILSZ_0			(0x1u<<0)

#define	DCMIPP_P2CCMRICR_ROI8EN_B_0X0		(0x0u<<23)
#define	DCMIPP_P2CCMRICR_ROI8EN_B_0X1		(0x1u<<23)
#define	DCMIPP_P2CCMRICR_ROI7EN_B_0X0		(0x0u<<22)
#define	DCMIPP_P2CCMRICR_ROI7EN_B_0X1		(0x1u<<22)
#define	DCMIPP_P2CCMRICR_ROI6EN_B_0X0		(0x0u<<21)
#define	DCMIPP_P2CCMRICR_ROI6EN_B_0X1		(0x1u<<21)
#define	DCMIPP_P2CCMRICR_ROI5EN_B_0X0		(0x0u<<20)
#define	DCMIPP_P2CCMRICR_ROI5EN_B_0X1		(0x1u<<20)
#define	DCMIPP_P2CCMRICR_ROI4EN_B_0X0		(0x0u<<19)
#define	DCMIPP_P2CCMRICR_ROI4EN_B_0X1		(0x1u<<19)
#define	DCMIPP_P2CCMRICR_ROI3EN_B_0X0		(0x0u<<18)
#define	DCMIPP_P2CCMRICR_ROI3EN_B_0X1		(0x1u<<18)
#define	DCMIPP_P2CCMRICR_ROI2EN_B_0X0		(0x0u<<17)
#define	DCMIPP_P2CCMRICR_ROI2EN_B_0X1		(0x1u<<17)
#define	DCMIPP_P2CCMRICR_ROI1EN_B_0X0		(0x0u<<16)
#define	DCMIPP_P2CCMRICR_ROI1EN_B_0X1		(0x1u<<16)
#define	DCMIPP_P2CCMRICR_ROILSZ_B_0X0		(0x0u<<0)
#define	DCMIPP_P2CCMRICR_ROILSZ_B_0X1		(0x1u<<0)
#define	DCMIPP_P2CCMRICR_ROILSZ_B_0X2		(0x2u<<0)
#define	DCMIPP_P2CCMRICR_ROILSZ_B_0X3		(0x3u<<0)

// P2CRI1CR1 Configuration

#define	DCMIPP_P2CRI1CR1_CLR				(0x3u<<28)
#define	DCMIPP_P2CRI1CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2CRI1CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CRI1CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2CRI1CR1_CLG				(0x3u<<14)
#define	DCMIPP_P2CRI1CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2CRI1CR1_CLB				(0x3u<<12)
#define	DCMIPP_P2CRI1CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2CRI1CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CRI1CR1_HSTART_0			(0x1u<<0)

// P2CRI1CR2 Configuration

#define	DCMIPP_P2CRI1CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CRI1CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P2CRI1CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CRI1CR2_HSIZE_0			(0x1u<<0)

// P2CRI2CR1 Configuration

#define	DCMIPP_P2CRI2CR1_CLR				(0x3u<<28)
#define	DCMIPP_P2CRI2CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2CRI2CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CRI2CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2CRI2CR1_CLG				(0x3u<<14)
#define	DCMIPP_P2CRI2CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2CRI2CR1_CLB				(0x3u<<12)
#define	DCMIPP_P2CRI2CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2CRI2CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CRI2CR1_HSTART_0			(0x1u<<0)

// P2CRI2CR2 Configuration

#define	DCMIPP_P2CRI2CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CRI2CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P2CRI2CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CRI2CR2_HSIZE_0			(0x1u<<0)

// P2CRI3CR1 Configuration

#define	DCMIPP_P2CRI3CR1_CLR				(0x3u<<28)
#define	DCMIPP_P2CRI3CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2CRI3CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CRI3CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2CRI3CR1_CLG				(0x3u<<14)
#define	DCMIPP_P2CRI3CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2CRI3CR1_CLB				(0x3u<<12)
#define	DCMIPP_P2CRI3CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2CRI3CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CRI3CR1_HSTART_0			(0x1u<<0)

// P2CRI3CR2 Configuration

#define	DCMIPP_P2CRI3CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CRI3CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P2CRI3CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CRI3CR2_HSIZE_0			(0x1u<<0)

// P2CRI4CR1 Configuration

#define	DCMIPP_P2CRI4CR1_CLR				(0x3u<<28)
#define	DCMIPP_P2CRI4CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2CRI4CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CRI4CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2CRI4CR1_CLG				(0x3u<<14)
#define	DCMIPP_P2CRI4CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2CRI4CR1_CLB				(0x3u<<12)
#define	DCMIPP_P2CRI4CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2CRI4CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CRI4CR1_HSTART_0			(0x1u<<0)

// P2CRI4CR2 Configuration

#define	DCMIPP_P2CRI4CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CRI4CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P2CRI4CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CRI4CR2_HSIZE_0			(0x1u<<0)

// P2CRI5CR1 Configuration

#define	DCMIPP_P2CRI5CR1_CLR				(0x3u<<28)
#define	DCMIPP_P2CRI5CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2CRI5CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CRI5CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2CRI5CR1_CLG				(0x3u<<14)
#define	DCMIPP_P2CRI5CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2CRI5CR1_CLB				(0x3u<<12)
#define	DCMIPP_P2CRI5CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2CRI5CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CRI5CR1_HSTART_0			(0x1u<<0)

// P2CRI5CR2 Configuration

#define	DCMIPP_P2CRI5CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CRI5CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P2CRI5CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CRI5CR2_HSIZE_0			(0x1u<<0)

// P2CRI6CR1 Configuration

