hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dcmipp.h
#define	DCMIPP_P2CRI6CR1_CLR				(0x3u<<28)
#define	DCMIPP_P2CRI6CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2CRI6CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CRI6CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2CRI6CR1_CLG				(0x3u<<14)
#define	DCMIPP_P2CRI6CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2CRI6CR1_CLB				(0x3u<<12)
#define	DCMIPP_P2CRI6CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2CRI6CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CRI6CR1_HSTART_0			(0x1u<<0)

// P2CRI6CR2 Configuration

#define	DCMIPP_P2CRI6CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CRI6CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P2CRI6CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CRI6CR2_HSIZE_0			(0x1u<<0)

// P2CRI7CR1 Configuration

#define	DCMIPP_P2CRI7CR1_CLR				(0x3u<<28)
#define	DCMIPP_P2CRI7CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2CRI7CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CRI7CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2CRI7CR1_CLG				(0x3u<<14)
#define	DCMIPP_P2CRI7CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2CRI7CR1_CLB				(0x3u<<12)
#define	DCMIPP_P2CRI7CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2CRI7CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CRI7CR1_HSTART_0			(0x1u<<0)

// P2CRI7CR2 Configuration

#define	DCMIPP_P2CRI7CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CRI7CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P2CRI7CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CRI7CR2_HSIZE_0			(0x1u<<0)

// P2CRI8CR1 Configuration

#define	DCMIPP_P2CRI8CR1_CLR				(0x3u<<28)
#define	DCMIPP_P2CRI8CR1_CLR_0				(0x1u<<28)
#define	DCMIPP_P2CRI8CR1_VSTART				(0xFFFu<<16)
#define	DCMIPP_P2CRI8CR1_VSTART_0			(0x1u<<16)
#define	DCMIPP_P2CRI8CR1_CLG				(0x3u<<14)
#define	DCMIPP_P2CRI8CR1_CLG_0				(0x1u<<14)
#define	DCMIPP_P2CRI8CR1_CLB				(0x3u<<12)
#define	DCMIPP_P2CRI8CR1_CLB_0				(0x1u<<12)
#define	DCMIPP_P2CRI8CR1_HSTART				(0xFFFu<<0)
#define	DCMIPP_P2CRI8CR1_HSTART_0			(0x1u<<0)

// P2CRI8CR2 Configuration

#define	DCMIPP_P2CRI8CR2_VSIZE				(0xFFFu<<16)
#define	DCMIPP_P2CRI8CR2_VSIZE_0			(0x1u<<16)
#define	DCMIPP_P2CRI8CR2_HSIZE				(0xFFFu<<0)
#define	DCMIPP_P2CRI8CR2_HSIZE_0			(0x1u<<0)

// P2CPPCR Configuration

#define	DCMIPP_P2CPPCR_LMAWE				(0x1u<<20)
#define	DCMIPP_P2CPPCR_LMAWM				(0x7u<<17)
#define	DCMIPP_P2CPPCR_LMAWM_0				(0x1u<<17)
#define	DCMIPP_P2CPPCR_DBM					(0x1u<<16)
#define	DCMIPP_P2CPPCR_LINEMULT				(0x7u<<13)
#define	DCMIPP_P2CPPCR_LINEMULT_0			(0x1u<<13)
#define	DCMIPP_P2CPPCR_SWAPRB				(0x1u<<4)
#define	DCMIPP_P2CPPCR_FORMAT				(0xFu<<0)
#define	DCMIPP_P2CPPCR_FORMAT_0				(0x1u<<0)

#define	DCMIPP_P2CPPCR_LMAWE_B_0X0			(0x0u<<20)
#define	DCMIPP_P2CPPCR_LMAWE_B_0X1			(0x1u<<20)
#define	DCMIPP_P2CPPCR_LMAWM_B_0X0			(0x0u<<17)
#define	DCMIPP_P2CPPCR_LMAWM_B_0X1			(0x1u<<17)
#define	DCMIPP_P2CPPCR_LMAWM_B_0X2			(0x2u<<17)
#define	DCMIPP_P2CPPCR_LMAWM_B_0X3			(0x3u<<17)
#define	DCMIPP_P2CPPCR_LMAWM_B_0X4			(0x4u<<17)
#define	DCMIPP_P2CPPCR_LMAWM_B_0X5			(0x5u<<17)
#define	DCMIPP_P2CPPCR_LMAWM_B_0X6			(0x6u<<17)
#define	DCMIPP_P2CPPCR_LMAWM_B_0X7			(0x7u<<17)
#define	DCMIPP_P2CPPCR_DBM_B_0X0			(0x0u<<16)
#define	DCMIPP_P2CPPCR_DBM_B_0X1			(0x1u<<16)
#define	DCMIPP_P2CPPCR_LINEMULT_B_0X0		(0x0u<<13)
#define	DCMIPP_P2CPPCR_LINEMULT_B_0X1		(0x1u<<13)
#define	DCMIPP_P2CPPCR_LINEMULT_B_0X2		(0x2u<<13)
#define	DCMIPP_P2CPPCR_LINEMULT_B_0X3		(0x3u<<13)
#define	DCMIPP_P2CPPCR_LINEMULT_B_0X4		(0x4u<<13)
#define	DCMIPP_P2CPPCR_LINEMULT_B_0X5		(0x5u<<13)
#define	DCMIPP_P2CPPCR_LINEMULT_B_0X6		(0x6u<<13)
#define	DCMIPP_P2CPPCR_LINEMULT_B_0X7		(0x7u<<13)
#define	DCMIPP_P2CPPCR_SWAPRB_B_0X0			(0x0u<<4)
#define	DCMIPP_P2CPPCR_SWAPRB_B_0X1			(0x1u<<4)
#define	DCMIPP_P2CPPCR_FORMAT_B_0X0			(0x0u<<0)
#define	DCMIPP_P2CPPCR_FORMAT_B_0X1			(0x1u<<0)
#define	DCMIPP_P2CPPCR_FORMAT_B_0X2			(0x2u<<0)
#define	DCMIPP_P2CPPCR_FORMAT_B_0X3			(0x3u<<0)
#define	DCMIPP_P2CPPCR_FORMAT_B_0X4			(0x4u<<0)
#define	DCMIPP_P2CPPCR_FORMAT_B_0X5			(0x5u<<0)
#define	DCMIPP_P2CPPCR_FORMAT_B_0X6			(0x6u<<0)

// P2CPPM0AR1 Configuration

#define	DCMIPP_P2CPPM0AR1_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P2CPPM0AR1_M0A_0				(0x1u<<0)

// P2CPPM0AR2 Configuration

#define	DCMIPP_P2CPPM0AR2_M0A				(0xFFFFFFFFu<<0)
#define	DCMIPP_P2CPPM0AR2_M0A_0				(0x1u<<0)
